; ModuleID = '/home/cookiengineer/Software/cookiengineer/ebpf-firewall/kernel/ebpf/module.c'
source_filename = "/home/cookiengineer/Software/cookiengineer/ebpf-firewall/kernel/ebpf/module.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon.9 = type { ptr, ptr, ptr, ptr }
%struct.anon.10 = type { ptr, ptr, ptr, ptr }
%struct.anon.11 = type { ptr, ptr, ptr, ptr }
%struct.anon.12 = type { ptr, ptr, ptr, ptr }
%struct.anon.13 = type { ptr, ptr, ptr, ptr }
%struct.xdp_md = type { i32, i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { i32, i32 }
%struct.udphdr = type { i16, i16, i16, i16 }
%struct.tcphdr = type { i16, i16, i32, i32, i16, i16, i16, i16 }
%struct.icmphdr = type { i8, i8, i16, %union.anon.5 }
%union.anon.5 = type { i32 }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %union.anon.1 }
%union.anon.1 = type { %struct.anon.2 }
%struct.anon.2 = type { %struct.in6_addr, %struct.in6_addr }
%struct.in6_addr = type { %union.anon.3 }
%union.anon.3 = type { [4 x i32] }
%struct.ipv6_opt_hdr = type { i8, i8 }
%struct.icmp6hdr = type { i8, i8, i16, %union.anon.8 }
%union.anon.8 = type { [1 x i32] }

@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !0

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !62, line: 625, type: !148, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.7", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !52, globals: !59, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/cookiengineer/Software/cookiengineer/ebpf-firewall/kernel/ebpf/module.c", directory: "/home/cookiengineer/Software/cookiengineer/ebpf-firewall/kernel", checksumkind: CSK_MD5, checksum: "da37557a86780204cc21c71a2f50af29")
!4 = !{!5, !14, !46}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 59, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "ebpf/../headers/common.h", directory: "/home/cookiengineer/Software/cookiengineer/ebpf-firewall/kernel", checksumkind: CSK_MD5, checksum: "0f2b21500512e7536bea338eb9a94a39")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 29, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/linux/in.h", directory: "", checksumkind: CSK_MD5, checksum: "800947bc91ad5a693098cf2699931b1e")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!38 = !DIEnumerator(name: "IPPROTO_L2TP", value: 115)
!39 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!40 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!41 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!42 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!43 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!44 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!45 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 106, baseType: !7, size: 32, elements: !47)
!47 = !{!48, !49, !50, !51}
!48 = !DIEnumerator(name: "BPF_ANY", value: 0)
!49 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!50 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!51 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!52 = !{!53, !54, !55, !57}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !6, line: 7, baseType: !56)
!56 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!59 = !{!0, !60, !82, !96, !112, !124, !132, !140}
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "port_bans", scope: !2, file: !62, line: 21, type: !63, isLocal: false, isDefinition: true)
!62 = !DIFile(filename: "ebpf/module.c", directory: "/home/cookiengineer/Software/cookiengineer/ebpf-firewall/kernel", checksumkind: CSK_MD5, checksum: "da37557a86780204cc21c71a2f50af29")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 16, size: 256, elements: !64)
!64 = !{!65, !71, !76, !78}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !63, file: !62, line: 17, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 32, elements: !69)
!68 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!69 = !{!70}
!70 = !DISubrange(count: 1)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !63, file: !62, line: 18, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 2097120, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 65535)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !63, file: !62, line: 19, baseType: !77, size: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !63, file: !62, line: 20, baseType: !79, size: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !6, line: 5, baseType: !81)
!81 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "ipv4_bans", scope: !2, file: !62, line: 28, type: !84, isLocal: false, isDefinition: true)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 23, size: 256, elements: !85)
!85 = !{!86, !87, !92, !95}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !84, file: !62, line: 24, baseType: !66, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !84, file: !62, line: 25, baseType: !88, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 16000000, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 500000)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !84, file: !62, line: 26, baseType: !93, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !6, line: 9, baseType: !7)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !84, file: !62, line: 27, baseType: !79, size: 64, offset: 192)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "ipv4_warnings", scope: !2, file: !62, line: 35, type: !98, isLocal: false, isDefinition: true)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 30, size: 256, elements: !99)
!99 = !{!100, !105, !110, !111}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !98, file: !62, line: 31, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 288, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 9)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !98, file: !62, line: 32, baseType: !106, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 4096, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !98, file: !62, line: 33, baseType: !93, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !98, file: !62, line: 34, baseType: !79, size: 64, offset: 192)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "ipv6_bans", scope: !2, file: !62, line: 42, type: !114, isLocal: false, isDefinition: true)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 37, size: 256, elements: !115)
!115 = !{!116, !117, !118, !123}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !114, file: !62, line: 38, baseType: !66, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !114, file: !62, line: 39, baseType: !88, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !114, file: !62, line: 40, baseType: !119, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint128_t", file: !121, baseType: !122)
!121 = !DIFile(filename: "ebpf/module.c", directory: "/home/cookiengineer/Software/cookiengineer/ebpf-firewall/kernel")
!122 = !DIBasicType(name: "unsigned __int128", size: 128, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !114, file: !62, line: 41, baseType: !79, size: 64, offset: 192)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "ipv6_warnings", scope: !2, file: !62, line: 49, type: !126, isLocal: false, isDefinition: true)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 44, size: 256, elements: !127)
!127 = !{!128, !129, !130, !131}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !126, file: !62, line: 45, baseType: !101, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !126, file: !62, line: 46, baseType: !106, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !126, file: !62, line: 47, baseType: !119, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !126, file: !62, line: 48, baseType: !79, size: 64, offset: 192)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !134, line: 51, type: !135, isLocal: true, isDefinition: true)
!134 = !DIFile(filename: "headers/bpf_helper_defs.h", directory: "/home/cookiengineer/Software/cookiengineer/ebpf-firewall/kernel", checksumkind: CSK_MD5, checksum: "67458ddab14190d1ab39602394f9ecef")
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!53, !53, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !134, line: 73, type: !142, isLocal: true, isDefinition: true)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!54, !53, !138, !138, !145}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !146, line: 31, baseType: !147)
!146 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!147 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 4)
!151 = !{i32 7, !"Dwarf Version", i32 5}
!152 = !{i32 2, !"Debug Info Version", i32 3}
!153 = !{i32 1, !"wchar_size", i32 4}
!154 = !{i32 7, !"frame-pointer", i32 2}
!155 = !{!"clang version 15.0.7"}
!156 = distinct !DISubprogram(name: "xdp_prog_main", scope: !62, file: !62, line: 301, type: !157, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !168)
!157 = !DISubroutineType(types: !158)
!158 = !{!68, !159}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 67, size: 192, elements: !161)
!161 = !{!162, !163, !164, !165, !166, !167}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !160, file: !6, line: 68, baseType: !94, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !160, file: !6, line: 69, baseType: !94, size: 32, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !160, file: !6, line: 70, baseType: !94, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !160, file: !6, line: 71, baseType: !94, size: 32, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !160, file: !6, line: 72, baseType: !94, size: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !160, file: !6, line: 73, baseType: !94, size: 32, offset: 160)
!168 = !{!169, !170, !171, !172, !173, !178, !192, !223, !266, !269, !270, !271, !282, !283, !284, !285, !309, !310, !311, !312, !338, !341, !342, !343, !346, !347, !348, !349, !352, !353, !354, !355, !358}
!169 = !DILocalVariable(name: "ctx", arg: 1, scope: !156, file: !62, line: 301, type: !159)
!170 = !DILocalVariable(name: "data_end", scope: !156, file: !62, line: 304, type: !53)
!171 = !DILocalVariable(name: "data", scope: !156, file: !62, line: 305, type: !53)
!172 = !DILocalVariable(name: "ethernet_protocol", scope: !156, file: !62, line: 311, type: !68)
!173 = !DILocalVariable(name: "cursor", scope: !156, file: !62, line: 312, type: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !175, line: 28, size: 64, elements: !176)
!175 = !DIFile(filename: "ebpf/module.h", directory: "/home/cookiengineer/Software/cookiengineer/ebpf-firewall/kernel", checksumkind: CSK_MD5, checksum: "5718562f868ed1a81948ae74a5df083a")
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !174, file: !175, line: 29, baseType: !53, size: 64)
!178 = !DILocalVariable(name: "ethernet_header", scope: !156, file: !62, line: 313, type: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !181, line: 173, size: 112, elements: !182)
!181 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "163f54fb1af2e21fea410f14eb18fa76")
!182 = !{!183, !187, !188}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !180, file: !181, line: 174, baseType: !184, size: 48)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 48, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 6)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !180, file: !181, line: 175, baseType: !184, size: 48, offset: 48)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !180, file: !181, line: 176, baseType: !189, size: 16, offset: 96)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !190, line: 28, baseType: !191)
!190 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "64bcf4b731906682de6e750679b9f4a2")
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !146, line: 24, baseType: !56)
!192 = !DILocalVariable(name: "ipv4_header", scope: !156, file: !62, line: 314, type: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !195, line: 87, size: 160, elements: !196)
!195 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "149778ace30a1ff208adc8783fd04b29")
!196 = !{!197, !199, !200, !201, !202, !203, !204, !205, !206, !208}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !194, file: !195, line: 89, baseType: !198, size: 4, flags: DIFlagBitField, extraData: i64 0)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !146, line: 21, baseType: !81)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !194, file: !195, line: 90, baseType: !198, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !194, file: !195, line: 97, baseType: !198, size: 8, offset: 8)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !194, file: !195, line: 98, baseType: !189, size: 16, offset: 16)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !194, file: !195, line: 99, baseType: !189, size: 16, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !194, file: !195, line: 100, baseType: !189, size: 16, offset: 48)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !194, file: !195, line: 101, baseType: !198, size: 8, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !194, file: !195, line: 102, baseType: !198, size: 8, offset: 72)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !194, file: !195, line: 103, baseType: !207, size: 16, offset: 80)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !190, line: 34, baseType: !191)
!208 = !DIDerivedType(tag: DW_TAG_member, scope: !194, file: !195, line: 104, baseType: !209, size: 64, offset: 96)
!209 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !194, file: !195, line: 104, size: 64, elements: !210)
!210 = !{!211, !218}
!211 = !DIDerivedType(tag: DW_TAG_member, scope: !209, file: !195, line: 104, baseType: !212, size: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !209, file: !195, line: 104, size: 64, elements: !213)
!213 = !{!214, !217}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !212, file: !195, line: 104, baseType: !215, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !190, line: 30, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !146, line: 27, baseType: !7)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !212, file: !195, line: 104, baseType: !215, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !209, file: !195, line: 104, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !209, file: !195, line: 104, size: 64, elements: !220)
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !219, file: !195, line: 104, baseType: !215, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !219, file: !195, line: 104, baseType: !215, size: 32, offset: 32)
!223 = !DILocalVariable(name: "ipv6_header", scope: !156, file: !62, line: 315, type: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !226, line: 118, size: 320, elements: !227)
!226 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "", checksumkind: CSK_MD5, checksum: "deff6bca6b519042089ed906aa3655c3")
!227 = !{!228, !229, !230, !234, !235, !236, !237}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !225, file: !226, line: 120, baseType: !198, size: 4, flags: DIFlagBitField, extraData: i64 0)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !225, file: !226, line: 121, baseType: !198, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !225, file: !226, line: 128, baseType: !231, size: 24, offset: 8)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 24, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 3)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !225, file: !226, line: 130, baseType: !189, size: 16, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !225, file: !226, line: 131, baseType: !198, size: 8, offset: 48)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !225, file: !226, line: 132, baseType: !198, size: 8, offset: 56)
!237 = !DIDerivedType(tag: DW_TAG_member, scope: !225, file: !226, line: 134, baseType: !238, size: 256, offset: 64)
!238 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !225, file: !226, line: 134, size: 256, elements: !239)
!239 = !{!240, !261}
!240 = !DIDerivedType(tag: DW_TAG_member, scope: !238, file: !226, line: 134, baseType: !241, size: 256)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !238, file: !226, line: 134, size: 256, elements: !242)
!242 = !{!243, !260}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !241, file: !226, line: 134, baseType: !244, size: 128)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !245, line: 33, size: 128, elements: !246)
!245 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "", checksumkind: CSK_MD5, checksum: "8bebb780b45d3fe932cc1d934fa5f5fe")
!246 = !{!247}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !244, file: !245, line: 40, baseType: !248, size: 128)
!248 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !244, file: !245, line: 34, size: 128, elements: !249)
!249 = !{!250, !254, !258}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !248, file: !245, line: 35, baseType: !251, size: 128)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 128, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 16)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !248, file: !245, line: 37, baseType: !255, size: 128)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 128, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 8)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !248, file: !245, line: 38, baseType: !259, size: 128)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 128, elements: !149)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !241, file: !226, line: 134, baseType: !244, size: 128, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !238, file: !226, line: 134, baseType: !262, size: 256)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !238, file: !226, line: 134, size: 256, elements: !263)
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !262, file: !226, line: 134, baseType: !244, size: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !262, file: !226, line: 134, baseType: !244, size: 128, offset: 128)
!266 = !DILocalVariable(name: "protocol", scope: !267, file: !62, line: 331, type: !68)
!267 = distinct !DILexicalBlock(scope: !268, file: !62, line: 329, column: 48)
!268 = distinct !DILexicalBlock(scope: !156, file: !62, line: 329, column: 6)
!269 = !DILocalVariable(name: "ipv4_source", scope: !267, file: !62, line: 333, type: !94)
!270 = !DILocalVariable(name: "ipv4_dest", scope: !267, file: !62, line: 334, type: !94)
!271 = !DILocalVariable(name: "udp_header", scope: !272, file: !62, line: 357, type: !274)
!272 = distinct !DILexicalBlock(scope: !273, file: !62, line: 355, column: 32)
!273 = distinct !DILexicalBlock(scope: !267, file: !62, line: 355, column: 7)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !276, line: 23, size: 64, elements: !277)
!276 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "", checksumkind: CSK_MD5, checksum: "53c0d42e1bf6d93b39151764be2d20fb")
!277 = !{!278, !279, !280, !281}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !275, file: !276, line: 24, baseType: !189, size: 16)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !275, file: !276, line: 25, baseType: !189, size: 16, offset: 16)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !275, file: !276, line: 26, baseType: !189, size: 16, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !275, file: !276, line: 27, baseType: !207, size: 16, offset: 48)
!282 = !DILocalVariable(name: "length", scope: !272, file: !62, line: 359, type: !68)
!283 = !DILocalVariable(name: "port_source", scope: !272, file: !62, line: 364, type: !55)
!284 = !DILocalVariable(name: "port_dest", scope: !272, file: !62, line: 371, type: !55)
!285 = !DILocalVariable(name: "tcp_header", scope: !286, file: !62, line: 406, type: !288)
!286 = distinct !DILexicalBlock(scope: !287, file: !62, line: 404, column: 39)
!287 = distinct !DILexicalBlock(scope: !273, file: !62, line: 404, column: 14)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !290, line: 25, size: 160, elements: !291)
!290 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "", checksumkind: CSK_MD5, checksum: "0fb7164446a017a2406c1e3b94b6d7a6")
!291 = !{!292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !289, file: !290, line: 26, baseType: !189, size: 16)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !289, file: !290, line: 27, baseType: !189, size: 16, offset: 16)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !289, file: !290, line: 28, baseType: !215, size: 32, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !289, file: !290, line: 29, baseType: !215, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !289, file: !290, line: 31, baseType: !191, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !289, file: !290, line: 32, baseType: !191, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !289, file: !290, line: 33, baseType: !191, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !289, file: !290, line: 34, baseType: !191, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !289, file: !290, line: 35, baseType: !191, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !289, file: !290, line: 36, baseType: !191, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !289, file: !290, line: 37, baseType: !191, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !289, file: !290, line: 38, baseType: !191, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !289, file: !290, line: 39, baseType: !191, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !289, file: !290, line: 40, baseType: !191, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !289, file: !290, line: 55, baseType: !189, size: 16, offset: 112)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !289, file: !290, line: 56, baseType: !207, size: 16, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !289, file: !290, line: 57, baseType: !189, size: 16, offset: 144)
!309 = !DILocalVariable(name: "length", scope: !286, file: !62, line: 408, type: !68)
!310 = !DILocalVariable(name: "port_source", scope: !286, file: !62, line: 420, type: !55)
!311 = !DILocalVariable(name: "port_dest", scope: !286, file: !62, line: 427, type: !55)
!312 = !DILocalVariable(name: "icmp_header", scope: !313, file: !62, line: 454, type: !315)
!313 = distinct !DILexicalBlock(scope: !314, file: !62, line: 452, column: 40)
!314 = distinct !DILexicalBlock(scope: !287, file: !62, line: 452, column: 14)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmphdr", file: !317, line: 89, size: 64, elements: !318)
!317 = !DIFile(filename: "/usr/include/linux/icmp.h", directory: "", checksumkind: CSK_MD5, checksum: "a505632898dce546638b3344627d334b")
!318 = !{!319, !320, !321, !322}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !316, file: !317, line: 90, baseType: !198, size: 8)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !316, file: !317, line: 91, baseType: !198, size: 8, offset: 8)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !316, file: !317, line: 92, baseType: !207, size: 16, offset: 16)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "un", scope: !316, file: !317, line: 104, baseType: !323, size: 32, offset: 32)
!323 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !316, file: !317, line: 93, size: 32, elements: !324)
!324 = !{!325, !330, !331, !336}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "echo", scope: !323, file: !317, line: 97, baseType: !326, size: 32)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !323, file: !317, line: 94, size: 32, elements: !327)
!327 = !{!328, !329}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !326, file: !317, line: 95, baseType: !189, size: 16)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !326, file: !317, line: 96, baseType: !189, size: 16, offset: 16)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "gateway", scope: !323, file: !317, line: 98, baseType: !215, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "frag", scope: !323, file: !317, line: 102, baseType: !332, size: 32)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !323, file: !317, line: 99, size: 32, elements: !333)
!333 = !{!334, !335}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !332, file: !317, line: 100, baseType: !189, size: 16)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !332, file: !317, line: 101, baseType: !189, size: 16, offset: 16)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !323, file: !317, line: 103, baseType: !337, size: 32)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 32, elements: !149)
!338 = !DILocalVariable(name: "protocol", scope: !339, file: !62, line: 474, type: !68)
!339 = distinct !DILexicalBlock(scope: !340, file: !62, line: 472, column: 57)
!340 = distinct !DILexicalBlock(scope: !268, file: !62, line: 472, column: 13)
!341 = !DILocalVariable(name: "ipv6_source", scope: !339, file: !62, line: 476, type: !120)
!342 = !DILocalVariable(name: "ipv6_dest", scope: !339, file: !62, line: 477, type: !120)
!343 = !DILocalVariable(name: "udp_header", scope: !344, file: !62, line: 500, type: !274)
!344 = distinct !DILexicalBlock(scope: !345, file: !62, line: 498, column: 32)
!345 = distinct !DILexicalBlock(scope: !339, file: !62, line: 498, column: 7)
!346 = !DILocalVariable(name: "length", scope: !344, file: !62, line: 502, type: !68)
!347 = !DILocalVariable(name: "port_source", scope: !344, file: !62, line: 507, type: !55)
!348 = !DILocalVariable(name: "port_dest", scope: !344, file: !62, line: 514, type: !55)
!349 = !DILocalVariable(name: "tcp_header", scope: !350, file: !62, line: 540, type: !288)
!350 = distinct !DILexicalBlock(scope: !351, file: !62, line: 538, column: 39)
!351 = distinct !DILexicalBlock(scope: !345, file: !62, line: 538, column: 14)
!352 = !DILocalVariable(name: "length", scope: !350, file: !62, line: 542, type: !68)
!353 = !DILocalVariable(name: "port_source", scope: !350, file: !62, line: 554, type: !55)
!354 = !DILocalVariable(name: "port_dest", scope: !350, file: !62, line: 561, type: !55)
!355 = !DILocalVariable(name: "icmp_header", scope: !356, file: !62, line: 587, type: !315)
!356 = distinct !DILexicalBlock(scope: !357, file: !62, line: 585, column: 40)
!357 = distinct !DILexicalBlock(scope: !351, file: !62, line: 585, column: 14)
!358 = !DILocalVariable(name: "icmp6_header", scope: !359, file: !62, line: 603, type: !361)
!359 = distinct !DILexicalBlock(scope: !360, file: !62, line: 601, column: 42)
!360 = distinct !DILexicalBlock(scope: !357, file: !62, line: 601, column: 14)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmp6hdr", file: !363, line: 8, size: 64, elements: !364)
!363 = !DIFile(filename: "/usr/include/linux/icmpv6.h", directory: "", checksumkind: CSK_MD5, checksum: "0310ca5584e6f44f6eea6cf040ee84b9")
!364 = !{!365, !366, !367, !368}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_type", scope: !362, file: !363, line: 10, baseType: !198, size: 8)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_code", scope: !362, file: !363, line: 11, baseType: !198, size: 8, offset: 8)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_cksum", scope: !362, file: !363, line: 12, baseType: !207, size: 16, offset: 16)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_dataun", scope: !362, file: !363, line: 63, baseType: !369, size: 32, offset: 32)
!369 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !362, file: !363, line: 15, size: 32, elements: !370)
!370 = !{!371, !373, !377, !378, !383, !391}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "un_data32", scope: !369, file: !363, line: 16, baseType: !372, size: 32)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 32, elements: !69)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "un_data16", scope: !369, file: !363, line: 17, baseType: !374, size: 32)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 32, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 2)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "un_data8", scope: !369, file: !363, line: 18, baseType: !337, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "u_echo", scope: !369, file: !363, line: 23, baseType: !379, size: 32)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_echo", file: !363, line: 20, size: 32, elements: !380)
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !379, file: !363, line: 21, baseType: !189, size: 16)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !379, file: !363, line: 22, baseType: !189, size: 16, offset: 16)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_advt", scope: !369, file: !363, line: 40, baseType: !384, size: 32)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_advt", file: !363, line: 25, size: 32, elements: !385)
!385 = !{!386, !387, !388, !389, !390}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !384, file: !363, line: 27, baseType: !216, size: 5, flags: DIFlagBitField, extraData: i64 0)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "override", scope: !384, file: !363, line: 28, baseType: !216, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "solicited", scope: !384, file: !363, line: 29, baseType: !216, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "router", scope: !384, file: !363, line: 30, baseType: !216, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !384, file: !363, line: 31, baseType: !216, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_ra", scope: !369, file: !363, line: 61, baseType: !392, size: 32)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_ra", file: !363, line: 42, size: 32, elements: !393)
!393 = !{!394, !395, !396, !397, !398, !399, !400}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !392, file: !363, line: 43, baseType: !198, size: 8)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !392, file: !363, line: 45, baseType: !198, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "router_pref", scope: !392, file: !363, line: 46, baseType: !198, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 8)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "home_agent", scope: !392, file: !363, line: 47, baseType: !198, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 8)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !392, file: !363, line: 48, baseType: !198, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 8)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "managed", scope: !392, file: !363, line: 49, baseType: !198, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 8)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "rt_lifetime", scope: !392, file: !363, line: 60, baseType: !189, size: 16, offset: 16)
!401 = !DILocation(line: 0, scope: !156)
!402 = !DILocation(line: 304, column: 38, scope: !156)
!403 = !{!404, !405, i64 4}
!404 = !{!"xdp_md", !405, i64 0, !405, i64 4, !405, i64 8, !405, i64 12, !405, i64 16, !405, i64 20}
!405 = !{!"int", !406, i64 0}
!406 = !{!"omnipotent char", !407, i64 0}
!407 = !{!"Simple C/C++ TBAA"}
!408 = !DILocation(line: 304, column: 27, scope: !156)
!409 = !DILocation(line: 304, column: 19, scope: !156)
!410 = !DILocation(line: 305, column: 34, scope: !156)
!411 = !{!404, !405, i64 0}
!412 = !DILocation(line: 305, column: 23, scope: !156)
!413 = !DILocation(line: 305, column: 15, scope: !156)
!414 = !DILocation(line: 307, column: 11, scope: !415)
!415 = distinct !DILexicalBlock(scope: !156, file: !62, line: 307, column: 6)
!416 = !DILocation(line: 307, column: 35, scope: !415)
!417 = !DILocation(line: 307, column: 6, scope: !156)
!418 = !DILocalVariable(name: "nh", arg: 1, scope: !419, file: !175, line: 151, type: !422)
!419 = distinct !DISubprogram(name: "parse_ethhdr", scope: !175, file: !175, line: 151, type: !420, scopeLine: 151, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !424)
!420 = !DISubroutineType(types: !421)
!421 = !{!68, !422, !53, !423}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!424 = !{!418, !425, !426, !427, !428, !435, !436}
!425 = !DILocalVariable(name: "data_end", arg: 2, scope: !419, file: !175, line: 151, type: !53)
!426 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !419, file: !175, line: 151, type: !423)
!427 = !DILocalVariable(name: "eth", scope: !419, file: !175, line: 153, type: !179)
!428 = !DILocalVariable(name: "vlh", scope: !419, file: !175, line: 154, type: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlanhdr", file: !175, line: 38, size: 32, elements: !431)
!431 = !{!432, !434}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !430, file: !175, line: 39, baseType: !433, size: 16)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !6, line: 20, baseType: !55)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !430, file: !175, line: 40, baseType: !433, size: 16, offset: 16)
!435 = !DILocalVariable(name: "h_proto", scope: !419, file: !175, line: 155, type: !55)
!436 = !DILocalVariable(name: "i", scope: !419, file: !175, line: 156, type: !68)
!437 = !DILocation(line: 0, scope: !419, inlinedAt: !438)
!438 = distinct !DILocation(line: 318, column: 22, scope: !156)
!439 = !DILocation(line: 164, column: 17, scope: !419, inlinedAt: !438)
!440 = !{!441, !441, i64 0}
!441 = !{!"short", !406, i64 0}
!442 = !DILocalVariable(name: "h_proto", arg: 1, scope: !443, file: !175, line: 109, type: !55)
!443 = distinct !DISubprogram(name: "proto_is_vlan", scope: !175, file: !175, line: 109, type: !444, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !446)
!444 = !DISubroutineType(types: !445)
!445 = !{!68, !55}
!446 = !{!442}
!447 = !DILocation(line: 0, scope: !443, inlinedAt: !448)
!448 = distinct !DILocation(line: 172, column: 8, scope: !449, inlinedAt: !438)
!449 = distinct !DILexicalBlock(scope: !450, file: !175, line: 172, column: 7)
!450 = distinct !DILexicalBlock(scope: !451, file: !175, line: 170, column: 39)
!451 = distinct !DILexicalBlock(scope: !452, file: !175, line: 170, column: 2)
!452 = distinct !DILexicalBlock(scope: !419, file: !175, line: 170, column: 2)
!453 = !DILocation(line: 110, column: 20, scope: !443, inlinedAt: !448)
!454 = !DILocation(line: 110, column: 46, scope: !443, inlinedAt: !448)
!455 = !DILocation(line: 172, column: 8, scope: !449, inlinedAt: !438)
!456 = !DILocation(line: 172, column: 7, scope: !450, inlinedAt: !438)
!457 = !DILocation(line: 180, column: 18, scope: !450, inlinedAt: !438)
!458 = !DILocation(line: 329, column: 6, scope: !156)
!459 = !DILocalVariable(name: "nh", arg: 1, scope: !460, file: !175, line: 191, type: !422)
!460 = distinct !DISubprogram(name: "parse_iphdr", scope: !175, file: !175, line: 191, type: !461, scopeLine: 191, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !464)
!461 = !DISubroutineType(types: !462)
!462 = !{!68, !422, !53, !463}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!464 = !{!459, !465, !466, !467, !468}
!465 = !DILocalVariable(name: "data_end", arg: 2, scope: !460, file: !175, line: 191, type: !53)
!466 = !DILocalVariable(name: "iphdr", arg: 3, scope: !460, file: !175, line: 191, type: !463)
!467 = !DILocalVariable(name: "iph", scope: !460, file: !175, line: 193, type: !193)
!468 = !DILocalVariable(name: "hdrsize", scope: !460, file: !175, line: 194, type: !68)
!469 = !DILocation(line: 0, scope: !460, inlinedAt: !470)
!470 = distinct !DILocation(line: 331, column: 18, scope: !267)
!471 = !DILocation(line: 196, column: 10, scope: !472, inlinedAt: !470)
!472 = distinct !DILexicalBlock(scope: !460, file: !175, line: 196, column: 6)
!473 = !DILocation(line: 196, column: 14, scope: !472, inlinedAt: !470)
!474 = !DILocation(line: 196, column: 6, scope: !460, inlinedAt: !470)
!475 = !DILocation(line: 200, column: 17, scope: !460, inlinedAt: !470)
!476 = !DILocation(line: 200, column: 21, scope: !460, inlinedAt: !470)
!477 = !DILocation(line: 203, column: 14, scope: !478, inlinedAt: !470)
!478 = distinct !DILexicalBlock(scope: !460, file: !175, line: 203, column: 6)
!479 = !DILocation(line: 203, column: 24, scope: !478, inlinedAt: !470)
!480 = !DILocation(line: 203, column: 6, scope: !460, inlinedAt: !470)
!481 = !DILocation(line: 0, scope: !267)
!482 = !DILocation(line: 333, column: 3, scope: !267)
!483 = !DILocation(line: 355, column: 7, scope: !267)
!484 = !DILocation(line: 210, column: 14, scope: !460, inlinedAt: !470)
!485 = !{!486, !406, i64 9}
!486 = !{!"iphdr", !406, i64 0, !406, i64 0, !406, i64 1, !441, i64 2, !441, i64 4, !441, i64 6, !406, i64 8, !406, i64 9, !441, i64 10, !406, i64 12}
!487 = !DILocation(line: 337, column: 4, scope: !488)
!488 = distinct !DILexicalBlock(scope: !489, file: !62, line: 336, column: 20)
!489 = distinct !DILexicalBlock(scope: !267, file: !62, line: 336, column: 7)
!490 = !DILocation(line: 341, column: 19, scope: !491)
!491 = distinct !DILexicalBlock(scope: !267, file: !62, line: 341, column: 7)
!492 = !DILocation(line: 341, column: 7, scope: !267)
!493 = !DILocalVariable(name: "address", arg: 1, scope: !494, file: !62, line: 119, type: !93)
!494 = distinct !DISubprogram(name: "is_filtered_ipv4", scope: !62, file: !62, line: 119, type: !495, scopeLine: 119, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !498)
!495 = !DISubroutineType(types: !496)
!496 = !{!497, !93}
!497 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!498 = !{!493, !499}
!499 = !DILocalVariable(name: "banned", scope: !494, file: !62, line: 121, type: !79)
!500 = !DILocation(line: 0, scope: !494, inlinedAt: !501)
!501 = distinct !DILocation(line: 343, column: 8, scope: !502)
!502 = distinct !DILexicalBlock(scope: !503, file: !62, line: 343, column: 8)
!503 = distinct !DILexicalBlock(scope: !491, file: !62, line: 341, column: 25)
!504 = !DILocation(line: 123, column: 11, scope: !494, inlinedAt: !501)
!505 = !DILocation(line: 125, column: 13, scope: !506, inlinedAt: !501)
!506 = distinct !DILexicalBlock(scope: !494, file: !62, line: 125, column: 6)
!507 = !DILocation(line: 343, column: 8, scope: !503)
!508 = !DILocation(line: 0, scope: !272)
!509 = !DILocalVariable(name: "nh", arg: 1, scope: !510, file: !175, line: 259, type: !422)
!510 = distinct !DISubprogram(name: "parse_udphdr", scope: !175, file: !175, line: 259, type: !511, scopeLine: 259, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !514)
!511 = !DISubroutineType(types: !512)
!512 = !{!68, !422, !53, !513}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!514 = !{!509, !515, !516, !517, !518}
!515 = !DILocalVariable(name: "data_end", arg: 2, scope: !510, file: !175, line: 259, type: !53)
!516 = !DILocalVariable(name: "udphdr", arg: 3, scope: !510, file: !175, line: 259, type: !513)
!517 = !DILocalVariable(name: "len", scope: !510, file: !175, line: 261, type: !68)
!518 = !DILocalVariable(name: "udph", scope: !510, file: !175, line: 262, type: !274)
!519 = !DILocation(line: 0, scope: !510, inlinedAt: !520)
!520 = distinct !DILocation(line: 359, column: 17, scope: !272)
!521 = !DILocation(line: 264, column: 11, scope: !522, inlinedAt: !520)
!522 = distinct !DILexicalBlock(scope: !510, file: !175, line: 264, column: 6)
!523 = !DILocation(line: 264, column: 15, scope: !522, inlinedAt: !520)
!524 = !DILocation(line: 264, column: 6, scope: !510, inlinedAt: !520)
!525 = !DILocation(line: 271, column: 8, scope: !510, inlinedAt: !520)
!526 = !{!527, !441, i64 4}
!527 = !{!"udphdr", !441, i64 0, !441, i64 2, !441, i64 4, !441, i64 6}
!528 = !DILocation(line: 272, column: 10, scope: !529, inlinedAt: !520)
!529 = distinct !DILexicalBlock(scope: !510, file: !175, line: 272, column: 6)
!530 = !DILocation(line: 272, column: 6, scope: !510, inlinedAt: !520)
!531 = !DILocation(line: 364, column: 36, scope: !272)
!532 = !{!527, !441, i64 0}
!533 = !DILocation(line: 0, scope: !534, inlinedAt: !540)
!534 = distinct !DISubprogram(name: "is_filtered_port", scope: !62, file: !62, line: 147, type: !535, scopeLine: 147, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !537)
!535 = !DISubroutineType(types: !536)
!536 = !{!497, !55}
!537 = !{!538, !539}
!538 = !DILocalVariable(name: "port", arg: 1, scope: !534, file: !62, line: 147, type: !55)
!539 = !DILocalVariable(name: "blocked_port", scope: !534, file: !62, line: 149, type: !79)
!540 = distinct !DILocation(line: 367, column: 8, scope: !541)
!541 = distinct !DILexicalBlock(scope: !272, file: !62, line: 367, column: 8)
!542 = !DILocation(line: 151, column: 17, scope: !534, inlinedAt: !540)
!543 = !DILocation(line: 153, column: 19, scope: !544, inlinedAt: !540)
!544 = distinct !DILexicalBlock(scope: !534, file: !62, line: 153, column: 6)
!545 = !DILocation(line: 159, column: 1, scope: !534, inlinedAt: !540)
!546 = !DILocation(line: 367, column: 8, scope: !272)
!547 = !DILocation(line: 371, column: 34, scope: !272)
!548 = !{!527, !441, i64 2}
!549 = !DILocation(line: 0, scope: !534, inlinedAt: !550)
!550 = distinct !DILocation(line: 374, column: 8, scope: !551)
!551 = distinct !DILexicalBlock(scope: !272, file: !62, line: 374, column: 8)
!552 = !DILocation(line: 151, column: 17, scope: !534, inlinedAt: !550)
!553 = !DILocation(line: 153, column: 19, scope: !544, inlinedAt: !550)
!554 = !DILocation(line: 159, column: 1, scope: !534, inlinedAt: !550)
!555 = !DILocation(line: 0, scope: !286)
!556 = !DILocalVariable(name: "nh", arg: 1, scope: !557, file: !175, line: 318, type: !422)
!557 = distinct !DISubprogram(name: "parse_tcphdr", scope: !175, file: !175, line: 318, type: !558, scopeLine: 318, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !561)
!558 = !DISubroutineType(types: !559)
!559 = !{!68, !422, !53, !560}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!561 = !{!556, !562, !563, !564, !565}
!562 = !DILocalVariable(name: "data_end", arg: 2, scope: !557, file: !175, line: 318, type: !53)
!563 = !DILocalVariable(name: "tcphdr", arg: 3, scope: !557, file: !175, line: 318, type: !560)
!564 = !DILocalVariable(name: "len", scope: !557, file: !175, line: 320, type: !68)
!565 = !DILocalVariable(name: "tcph", scope: !557, file: !175, line: 321, type: !288)
!566 = !DILocation(line: 0, scope: !557, inlinedAt: !567)
!567 = distinct !DILocation(line: 408, column: 17, scope: !286)
!568 = !DILocation(line: 323, column: 11, scope: !569, inlinedAt: !567)
!569 = distinct !DILexicalBlock(scope: !557, file: !175, line: 323, column: 6)
!570 = !DILocation(line: 323, column: 15, scope: !569, inlinedAt: !567)
!571 = !DILocation(line: 323, column: 6, scope: !557, inlinedAt: !567)
!572 = !DILocation(line: 327, column: 14, scope: !557, inlinedAt: !567)
!573 = !DILocation(line: 327, column: 19, scope: !557, inlinedAt: !567)
!574 = !DILocation(line: 328, column: 20, scope: !575, inlinedAt: !567)
!575 = distinct !DILexicalBlock(scope: !557, file: !175, line: 328, column: 6)
!576 = !DILocation(line: 328, column: 26, scope: !575, inlinedAt: !567)
!577 = !DILocation(line: 328, column: 6, scope: !557, inlinedAt: !567)
!578 = !DILocalVariable(name: "tcp_header", arg: 1, scope: !579, file: !62, line: 239, type: !288)
!579 = distinct !DISubprogram(name: "is_filtered_nmap_tcp_scan", scope: !62, file: !62, line: 239, type: !580, scopeLine: 239, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !582)
!580 = !DISubroutineType(types: !581)
!581 = !{!497, !288}
!582 = !{!578}
!583 = !DILocation(line: 0, scope: !579, inlinedAt: !584)
!584 = distinct !DILocation(line: 414, column: 8, scope: !585)
!585 = distinct !DILexicalBlock(scope: !286, file: !62, line: 414, column: 8)
!586 = !DILocation(line: 243, column: 3, scope: !587, inlinedAt: !584)
!587 = distinct !DILexicalBlock(scope: !579, file: !62, line: 242, column: 3)
!588 = !DILocation(line: 264, column: 18, scope: !589, inlinedAt: !584)
!589 = distinct !DILexicalBlock(scope: !579, file: !62, line: 256, column: 3)
!590 = !{!591, !441, i64 14}
!591 = !{!"tcphdr", !441, i64 0, !441, i64 2, !405, i64 4, !405, i64 8, !441, i64 12, !441, i64 12, !441, i64 13, !441, i64 13, !441, i64 13, !441, i64 13, !441, i64 13, !441, i64 13, !441, i64 13, !441, i64 13, !441, i64 14, !441, i64 16, !441, i64 18}
!592 = !DILocation(line: 264, column: 25, scope: !589, inlinedAt: !584)
!593 = !DILocation(line: 256, column: 3, scope: !579, inlinedAt: !584)
!594 = !DILocalVariable(name: "tcp_header", arg: 1, scope: !595, file: !62, line: 273, type: !288)
!595 = distinct !DISubprogram(name: "is_likely_nmap_tcp_scan", scope: !62, file: !62, line: 273, type: !580, scopeLine: 273, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !596)
!596 = !{!594}
!597 = !DILocation(line: 0, scope: !595, inlinedAt: !598)
!598 = distinct !DILocation(line: 416, column: 15, scope: !599)
!599 = distinct !DILexicalBlock(scope: !585, file: !62, line: 416, column: 15)
!600 = !DILocation(line: 279, column: 3, scope: !601, inlinedAt: !598)
!601 = distinct !DILexicalBlock(scope: !595, file: !62, line: 278, column: 3)
!602 = !DILocation(line: 285, column: 18, scope: !601, inlinedAt: !598)
!603 = !DILocation(line: 285, column: 25, scope: !601, inlinedAt: !598)
!604 = !DILocation(line: 278, column: 3, scope: !595, inlinedAt: !598)
!605 = !DILocalVariable(name: "address", arg: 1, scope: !606, file: !62, line: 51, type: !93)
!606 = distinct !DISubprogram(name: "warn_ipv4", scope: !62, file: !62, line: 51, type: !607, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !608)
!607 = !DISubroutineType(cc: DW_CC_nocall, types: !496)
!608 = !{!605, !609, !610, !613, !616}
!609 = !DILocalVariable(name: "warnings_ipv4", scope: !606, file: !62, line: 53, type: !79)
!610 = !DILocalVariable(name: "tmp", scope: !611, file: !62, line: 59, type: !80)
!611 = distinct !DILexicalBlock(scope: !612, file: !62, line: 57, column: 29)
!612 = distinct !DILexicalBlock(scope: !606, file: !62, line: 57, column: 6)
!613 = !DILocalVariable(name: "banned", scope: !614, file: !62, line: 67, type: !80)
!614 = distinct !DILexicalBlock(scope: !615, file: !62, line: 65, column: 17)
!615 = distinct !DILexicalBlock(scope: !611, file: !62, line: 65, column: 7)
!616 = !DILocalVariable(name: "tmp", scope: !617, file: !62, line: 75, type: !80)
!617 = distinct !DILexicalBlock(scope: !612, file: !62, line: 73, column: 9)
!618 = !DILocation(line: 0, scope: !606, inlinedAt: !619)
!619 = distinct !DILocation(line: 417, column: 5, scope: !620)
!620 = distinct !DILexicalBlock(scope: !599, file: !62, line: 416, column: 60)
!621 = !DILocation(line: 55, column: 18, scope: !606, inlinedAt: !619)
!622 = !DILocation(line: 57, column: 20, scope: !612, inlinedAt: !619)
!623 = !DILocation(line: 57, column: 6, scope: !606, inlinedAt: !619)
!624 = !DILocation(line: 59, column: 3, scope: !611, inlinedAt: !619)
!625 = !DILocation(line: 0, scope: !611, inlinedAt: !619)
!626 = !DILocation(line: 61, column: 9, scope: !611, inlinedAt: !619)
!627 = !{!406, !406, i64 0}
!628 = !DILocation(line: 61, column: 24, scope: !611, inlinedAt: !619)
!629 = !DILocation(line: 61, column: 7, scope: !611, inlinedAt: !619)
!630 = !DILocation(line: 63, column: 3, scope: !611, inlinedAt: !619)
!631 = !DILocation(line: 65, column: 7, scope: !615, inlinedAt: !619)
!632 = !DILocation(line: 65, column: 11, scope: !615, inlinedAt: !619)
!633 = !DILocation(line: 65, column: 7, scope: !611, inlinedAt: !619)
!634 = !DILocation(line: 67, column: 4, scope: !614, inlinedAt: !619)
!635 = !DILocation(line: 0, scope: !614, inlinedAt: !619)
!636 = !DILocation(line: 67, column: 9, scope: !614, inlinedAt: !619)
!637 = !DILocation(line: 69, column: 4, scope: !614, inlinedAt: !619)
!638 = !DILocation(line: 71, column: 3, scope: !615, inlinedAt: !619)
!639 = !DILocation(line: 71, column: 3, scope: !614, inlinedAt: !619)
!640 = !DILocation(line: 73, column: 2, scope: !612, inlinedAt: !619)
!641 = !DILocation(line: 73, column: 2, scope: !611, inlinedAt: !619)
!642 = !DILocation(line: 75, column: 3, scope: !617, inlinedAt: !619)
!643 = !DILocation(line: 0, scope: !617, inlinedAt: !619)
!644 = !DILocation(line: 75, column: 8, scope: !617, inlinedAt: !619)
!645 = !DILocation(line: 77, column: 3, scope: !617, inlinedAt: !619)
!646 = !DILocation(line: 79, column: 2, scope: !612, inlinedAt: !619)
!647 = !DILocation(line: 420, column: 36, scope: !286)
!648 = !{!591, !441, i64 0}
!649 = !DILocation(line: 0, scope: !534, inlinedAt: !650)
!650 = distinct !DILocation(line: 423, column: 8, scope: !651)
!651 = distinct !DILexicalBlock(scope: !286, file: !62, line: 423, column: 8)
!652 = !DILocation(line: 151, column: 17, scope: !534, inlinedAt: !650)
!653 = !DILocation(line: 153, column: 19, scope: !544, inlinedAt: !650)
!654 = !DILocation(line: 159, column: 1, scope: !534, inlinedAt: !650)
!655 = !DILocation(line: 423, column: 8, scope: !286)
!656 = !DILocation(line: 427, column: 34, scope: !286)
!657 = !{!591, !441, i64 2}
!658 = !DILocation(line: 0, scope: !534, inlinedAt: !659)
!659 = distinct !DILocation(line: 430, column: 8, scope: !660)
!660 = distinct !DILexicalBlock(scope: !286, file: !62, line: 430, column: 8)
!661 = !DILocation(line: 151, column: 17, scope: !534, inlinedAt: !659)
!662 = !DILocation(line: 153, column: 19, scope: !544, inlinedAt: !659)
!663 = !DILocation(line: 159, column: 1, scope: !534, inlinedAt: !659)
!664 = !DILocation(line: 0, scope: !313)
!665 = !DILocalVariable(name: "nh", arg: 1, scope: !666, file: !175, line: 214, type: !422)
!666 = distinct !DISubprogram(name: "parse_icmphdr", scope: !175, file: !175, line: 214, type: !667, scopeLine: 214, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !670)
!667 = !DISubroutineType(cc: DW_CC_nocall, types: !668)
!668 = !{!68, !422, !53, !669}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!670 = !{!665, !671, !672, !673}
!671 = !DILocalVariable(name: "data_end", arg: 2, scope: !666, file: !175, line: 214, type: !53)
!672 = !DILocalVariable(name: "icmphdr", arg: 3, scope: !666, file: !175, line: 214, type: !669)
!673 = !DILocalVariable(name: "icmph", scope: !666, file: !175, line: 216, type: !315)
!674 = !DILocation(line: 0, scope: !666, inlinedAt: !675)
!675 = distinct !DILocation(line: 456, column: 4, scope: !313)
!676 = !DILocation(line: 218, column: 12, scope: !677, inlinedAt: !675)
!677 = distinct !DILexicalBlock(scope: !666, file: !175, line: 218, column: 6)
!678 = !DILocation(line: 218, column: 16, scope: !677, inlinedAt: !675)
!679 = !DILocation(line: 218, column: 6, scope: !666, inlinedAt: !675)
!680 = !DILocalVariable(name: "icmp_header", arg: 1, scope: !681, file: !62, line: 161, type: !315)
!681 = distinct !DISubprogram(name: "is_filtered_icmp_packet", scope: !62, file: !62, line: 161, type: !682, scopeLine: 161, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !684)
!682 = !DISubroutineType(types: !683)
!683 = !{!497, !315}
!684 = !{!680, !685}
!685 = !DILocalVariable(name: "type", scope: !681, file: !62, line: 163, type: !68)
!686 = !DILocation(line: 0, scope: !681, inlinedAt: !687)
!687 = distinct !DILocation(line: 458, column: 23, scope: !688)
!688 = distinct !DILexicalBlock(scope: !313, file: !62, line: 458, column: 8)
!689 = !DILocation(line: 163, column: 26, scope: !681, inlinedAt: !687)
!690 = !{!691, !406, i64 0}
!691 = !{!"icmphdr", !406, i64 0, !406, i64 1, !441, i64 2, !406, i64 4}
!692 = !DILocation(line: 166, column: 8, scope: !693, inlinedAt: !687)
!693 = distinct !DILexicalBlock(scope: !681, file: !62, line: 166, column: 3)
!694 = !DILocation(line: 167, column: 3, scope: !693, inlinedAt: !687)
!695 = !DILocation(line: 182, column: 18, scope: !693, inlinedAt: !687)
!696 = !DILocation(line: 470, column: 3, scope: !267)
!697 = !DILocation(line: 472, column: 2, scope: !268)
!698 = !DILocalVariable(name: "nh", arg: 1, scope: !699, file: !175, line: 229, type: !422)
!699 = distinct !DISubprogram(name: "parse_ipv6hdr", scope: !175, file: !175, line: 229, type: !700, scopeLine: 229, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !703)
!700 = !DISubroutineType(types: !701)
!701 = !{!68, !422, !53, !702}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!703 = !{!698, !704, !705, !706}
!704 = !DILocalVariable(name: "data_end", arg: 2, scope: !699, file: !175, line: 229, type: !53)
!705 = !DILocalVariable(name: "ip6hdr", arg: 3, scope: !699, file: !175, line: 229, type: !702)
!706 = !DILocalVariable(name: "ip6h", scope: !699, file: !175, line: 231, type: !224)
!707 = !DILocation(line: 0, scope: !699, inlinedAt: !708)
!708 = distinct !DILocation(line: 474, column: 18, scope: !339)
!709 = !DILocation(line: 233, column: 11, scope: !710, inlinedAt: !708)
!710 = distinct !DILexicalBlock(scope: !699, file: !175, line: 233, column: 6)
!711 = !DILocation(line: 233, column: 15, scope: !710, inlinedAt: !708)
!712 = !DILocation(line: 233, column: 6, scope: !699, inlinedAt: !708)
!713 = !DILocalVariable(name: "nh", arg: 1, scope: !714, file: !175, line: 113, type: !422)
!714 = distinct !DISubprogram(name: "skip_ip6hdrext", scope: !175, file: !175, line: 113, type: !715, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !717)
!715 = !DISubroutineType(types: !716)
!716 = !{!68, !422, !53, !80}
!717 = !{!713, !718, !719, !720, !722}
!718 = !DILocalVariable(name: "data_end", arg: 2, scope: !714, file: !175, line: 113, type: !53)
!719 = !DILocalVariable(name: "next_hdr_type", arg: 3, scope: !714, file: !175, line: 113, type: !80)
!720 = !DILocalVariable(name: "i", scope: !721, file: !175, line: 115, type: !68)
!721 = distinct !DILexicalBlock(scope: !714, file: !175, line: 115, column: 2)
!722 = !DILocalVariable(name: "hdr", scope: !723, file: !175, line: 117, type: !725)
!723 = distinct !DILexicalBlock(scope: !724, file: !175, line: 115, column: 46)
!724 = distinct !DILexicalBlock(scope: !721, file: !175, line: 115, column: 2)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6_opt_hdr", file: !226, line: 63, size: 16, elements: !727)
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !726, file: !226, line: 64, baseType: !198, size: 8)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "hdrlen", scope: !726, file: !226, line: 65, baseType: !198, size: 8, offset: 8)
!730 = !DILocation(line: 0, scope: !714, inlinedAt: !731)
!731 = distinct !DILocation(line: 240, column: 9, scope: !699, inlinedAt: !708)
!732 = !DILocation(line: 0, scope: !721, inlinedAt: !731)
!733 = !DILocation(line: 0, scope: !723, inlinedAt: !731)
!734 = !DILocation(line: 119, column: 11, scope: !735, inlinedAt: !731)
!735 = distinct !DILexicalBlock(scope: !723, file: !175, line: 119, column: 7)
!736 = !DILocation(line: 119, column: 15, scope: !735, inlinedAt: !731)
!737 = !DILocation(line: 119, column: 7, scope: !723, inlinedAt: !731)
!738 = !DILocation(line: 240, column: 44, scope: !699, inlinedAt: !708)
!739 = !{!740, !406, i64 6}
!740 = !{!"ipv6hdr", !406, i64 0, !406, i64 0, !406, i64 1, !441, i64 4, !406, i64 6, !406, i64 7, !406, i64 8}
!741 = !DILocation(line: 123, column: 3, scope: !723, inlinedAt: !731)
!742 = !DILocation(line: 135, column: 5, scope: !743, inlinedAt: !731)
!743 = distinct !DILexicalBlock(scope: !723, file: !175, line: 123, column: 26)
!744 = !DILocation(line: 123, column: 11, scope: !723, inlinedAt: !731)
!745 = !DILocation(line: 141, column: 5, scope: !743, inlinedAt: !731)
!746 = !DILocation(line: 0, scope: !743, inlinedAt: !731)
!747 = !{!748, !406, i64 1}
!748 = !{!"ipv6_opt_hdr", !406, i64 0, !406, i64 1}
!749 = !{!748, !406, i64 0}
!750 = !DILocation(line: 131, column: 5, scope: !743, inlinedAt: !731)
!751 = !DILocation(line: 137, column: 27, scope: !743, inlinedAt: !731)
!752 = !DILocation(line: 139, column: 5, scope: !743, inlinedAt: !731)
!753 = !DILocation(line: 133, column: 35, scope: !743, inlinedAt: !731)
!754 = !DILocation(line: 133, column: 30, scope: !743, inlinedAt: !731)
!755 = !DILocation(line: 133, column: 47, scope: !743, inlinedAt: !731)
!756 = !DILocation(line: 133, column: 27, scope: !743, inlinedAt: !731)
!757 = !DILocation(line: 129, column: 35, scope: !743, inlinedAt: !731)
!758 = !DILocation(line: 129, column: 30, scope: !743, inlinedAt: !731)
!759 = !DILocation(line: 129, column: 47, scope: !743, inlinedAt: !731)
!760 = !DILocation(line: 129, column: 27, scope: !743, inlinedAt: !731)
!761 = !DILocation(line: 0, scope: !339)
!762 = !DILocation(line: 476, column: 3, scope: !339)
!763 = !DILocation(line: 498, column: 7, scope: !339)
!764 = !DILocation(line: 480, column: 4, scope: !765)
!765 = distinct !DILexicalBlock(scope: !766, file: !62, line: 479, column: 20)
!766 = distinct !DILexicalBlock(scope: !339, file: !62, line: 479, column: 7)
!767 = !DILocation(line: 484, column: 7, scope: !768)
!768 = distinct !DILexicalBlock(scope: !339, file: !62, line: 484, column: 7)
!769 = !{!770, !770, i64 0}
!770 = !{!"__int128", !406, i64 0}
!771 = !DILocation(line: 484, column: 19, scope: !768)
!772 = !DILocation(line: 484, column: 7, scope: !339)
!773 = !DILocalVariable(name: "address", arg: 1, scope: !774, file: !62, line: 133, type: !119)
!774 = distinct !DISubprogram(name: "is_filtered_ipv6", scope: !62, file: !62, line: 133, type: !775, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !777)
!775 = !DISubroutineType(types: !776)
!776 = !{!497, !119}
!777 = !{!773, !778}
!778 = !DILocalVariable(name: "banned", scope: !774, file: !62, line: 135, type: !79)
!779 = !DILocation(line: 0, scope: !774, inlinedAt: !780)
!780 = distinct !DILocation(line: 486, column: 8, scope: !781)
!781 = distinct !DILexicalBlock(scope: !782, file: !62, line: 486, column: 8)
!782 = distinct !DILexicalBlock(scope: !768, file: !62, line: 484, column: 25)
!783 = !DILocation(line: 137, column: 11, scope: !774, inlinedAt: !780)
!784 = !DILocation(line: 139, column: 13, scope: !785, inlinedAt: !780)
!785 = distinct !DILexicalBlock(scope: !774, file: !62, line: 139, column: 6)
!786 = !DILocation(line: 486, column: 8, scope: !782)
!787 = !DILocation(line: 0, scope: !344)
