; ModuleID = '/home/cookiengineer/Software/cookiengineer/ebpf-firewall/kernel/ebpf/module.c'
source_filename = "/home/cookiengineer/Software/cookiengineer/ebpf-firewall/kernel/ebpf/module.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon.9 = type { ptr, ptr, ptr, ptr }
%struct.anon.10 = type { ptr, ptr, ptr, ptr }
%struct.anon.11 = type { ptr, ptr, ptr, ptr }
%struct.anon.12 = type { ptr, ptr, ptr, ptr }
%struct.anon.13 = type { ptr, ptr, ptr, ptr }
%struct.anon.14 = type { ptr, ptr, ptr, ptr }
%struct.xdp_md = type { i32, i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { i32, i32 }
%struct.udphdr = type { i16, i16, i16, i16 }
%struct.tcphdr = type { i16, i16, i32, i32, i16, i16, i16, i16 }
%struct.icmphdr = type { i8, i8, i16, %union.anon.5 }
%union.anon.5 = type { i32 }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %union.anon.1 }
%union.anon.1 = type { %struct.anon.2 }
%struct.anon.2 = type { %struct.in6_addr, %struct.in6_addr }
%struct.in6_addr = type { %union.anon.3 }
%union.anon.3 = type { [4 x i32] }
%struct.ipv6_opt_hdr = type { i8, i8 }
%struct.icmp6hdr = type { i8, i8, i16, %union.anon.8 }
%union.anon.8 = type { [1 x i32] }

@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !0

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !62, line: 638, type: !160, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.7", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !52, globals: !59, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/cookiengineer/Software/cookiengineer/ebpf-firewall/kernel/ebpf/module.c", directory: "/home/cookiengineer/Software/cookiengineer/ebpf-firewall/kernel", checksumkind: CSK_MD5, checksum: "ab6398d954245ab03791f0b2699edd78")
!4 = !{!5, !14, !46}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 59, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "ebpf/../headers/common.h", directory: "/home/cookiengineer/Software/cookiengineer/ebpf-firewall/kernel", checksumkind: CSK_MD5, checksum: "0f2b21500512e7536bea338eb9a94a39")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 29, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/linux/in.h", directory: "", checksumkind: CSK_MD5, checksum: "800947bc91ad5a693098cf2699931b1e")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!38 = !DIEnumerator(name: "IPPROTO_L2TP", value: 115)
!39 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!40 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!41 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!42 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!43 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!44 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!45 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 106, baseType: !7, size: 32, elements: !47)
!47 = !{!48, !49, !50, !51}
!48 = !DIEnumerator(name: "BPF_ANY", value: 0)
!49 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!50 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!51 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!52 = !{!53, !54, !55, !57}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !6, line: 7, baseType: !56)
!56 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!59 = !{!0, !60, !85, !95, !111, !123, !131, !144, !152}
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "domain_bans", scope: !2, file: !62, line: 21, type: !63, isLocal: false, isDefinition: true)
!62 = !DIFile(filename: "ebpf/module.c", directory: "/home/cookiengineer/Software/cookiengineer/ebpf-firewall/kernel", checksumkind: CSK_MD5, checksum: "ab6398d954245ab03791f0b2699edd78")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 16, size: 256, elements: !64)
!64 = !{!65, !71, !76, !81}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !63, file: !62, line: 17, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 32, elements: !69)
!68 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!69 = !{!70}
!70 = !DISubrange(count: 1)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !63, file: !62, line: 18, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 16000000, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 500000)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !63, file: !62, line: 19, baseType: !77, size: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 8128, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 254)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !63, file: !62, line: 20, baseType: !82, size: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !6, line: 5, baseType: !84)
!84 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "ipv4_bans", scope: !2, file: !62, line: 28, type: !87, isLocal: false, isDefinition: true)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 23, size: 256, elements: !88)
!88 = !{!89, !90, !91, !94}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !62, line: 24, baseType: !66, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !87, file: !62, line: 25, baseType: !72, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !87, file: !62, line: 26, baseType: !92, size: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !6, line: 9, baseType: !7)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !87, file: !62, line: 27, baseType: !82, size: 64, offset: 192)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "ipv4_warnings", scope: !2, file: !62, line: 35, type: !97, isLocal: false, isDefinition: true)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 30, size: 256, elements: !98)
!98 = !{!99, !104, !109, !110}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !97, file: !62, line: 31, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 288, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 9)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !97, file: !62, line: 32, baseType: !105, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 4096, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !97, file: !62, line: 33, baseType: !92, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !97, file: !62, line: 34, baseType: !82, size: 64, offset: 192)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "ipv6_bans", scope: !2, file: !62, line: 42, type: !113, isLocal: false, isDefinition: true)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 37, size: 256, elements: !114)
!114 = !{!115, !116, !117, !122}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !113, file: !62, line: 38, baseType: !66, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !113, file: !62, line: 39, baseType: !72, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !113, file: !62, line: 40, baseType: !118, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint128_t", file: !120, baseType: !121)
!120 = !DIFile(filename: "ebpf/module.c", directory: "/home/cookiengineer/Software/cookiengineer/ebpf-firewall/kernel")
!121 = !DIBasicType(name: "unsigned __int128", size: 128, encoding: DW_ATE_unsigned)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !113, file: !62, line: 41, baseType: !82, size: 64, offset: 192)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "ipv6_warnings", scope: !2, file: !62, line: 49, type: !125, isLocal: false, isDefinition: true)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 44, size: 256, elements: !126)
!126 = !{!127, !128, !129, !130}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !125, file: !62, line: 45, baseType: !100, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !125, file: !62, line: 46, baseType: !105, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !125, file: !62, line: 47, baseType: !118, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !125, file: !62, line: 48, baseType: !82, size: 64, offset: 192)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "port_bans", scope: !2, file: !62, line: 56, type: !133, isLocal: false, isDefinition: true)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 51, size: 256, elements: !134)
!134 = !{!135, !136, !141, !143}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !133, file: !62, line: 52, baseType: !66, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !133, file: !62, line: 53, baseType: !137, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 2097120, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 65535)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !133, file: !62, line: 54, baseType: !142, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !133, file: !62, line: 55, baseType: !82, size: 64, offset: 192)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !146, line: 51, type: !147, isLocal: true, isDefinition: true)
!146 = !DIFile(filename: "headers/bpf_helper_defs.h", directory: "/home/cookiengineer/Software/cookiengineer/ebpf-firewall/kernel", checksumkind: CSK_MD5, checksum: "67458ddab14190d1ab39602394f9ecef")
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!53, !53, !150}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !146, line: 73, type: !154, isLocal: true, isDefinition: true)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!54, !53, !150, !150, !157}
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !158, line: 31, baseType: !159)
!158 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!159 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 4)
!163 = !{i32 7, !"Dwarf Version", i32 5}
!164 = !{i32 2, !"Debug Info Version", i32 3}
!165 = !{i32 1, !"wchar_size", i32 4}
!166 = !{i32 7, !"frame-pointer", i32 2}
!167 = !{!"clang version 15.0.7"}
!168 = distinct !DISubprogram(name: "xdp_prog_main", scope: !62, file: !62, line: 314, type: !169, scopeLine: 314, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !180)
!169 = !DISubroutineType(types: !170)
!170 = !{!68, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 67, size: 192, elements: !173)
!173 = !{!174, !175, !176, !177, !178, !179}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !172, file: !6, line: 68, baseType: !93, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !172, file: !6, line: 69, baseType: !93, size: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !172, file: !6, line: 70, baseType: !93, size: 32, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !172, file: !6, line: 71, baseType: !93, size: 32, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !172, file: !6, line: 72, baseType: !93, size: 32, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !172, file: !6, line: 73, baseType: !93, size: 32, offset: 160)
!180 = !{!181, !182, !183, !184, !185, !190, !204, !235, !278, !281, !282, !283, !294, !295, !296, !297, !321, !322, !323, !324, !350, !353, !354, !355, !358, !359, !360, !361, !364, !365, !366, !367, !370}
!181 = !DILocalVariable(name: "ctx", arg: 1, scope: !168, file: !62, line: 314, type: !171)
!182 = !DILocalVariable(name: "data_end", scope: !168, file: !62, line: 317, type: !53)
!183 = !DILocalVariable(name: "data", scope: !168, file: !62, line: 318, type: !53)
!184 = !DILocalVariable(name: "ethernet_protocol", scope: !168, file: !62, line: 324, type: !68)
!185 = !DILocalVariable(name: "cursor", scope: !168, file: !62, line: 325, type: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !187, line: 28, size: 64, elements: !188)
!187 = !DIFile(filename: "ebpf/module.h", directory: "/home/cookiengineer/Software/cookiengineer/ebpf-firewall/kernel", checksumkind: CSK_MD5, checksum: "a8cb7812e84cb0d7626c35fc624fbe3c")
!188 = !{!189}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !186, file: !187, line: 29, baseType: !53, size: 64)
!190 = !DILocalVariable(name: "ethernet_header", scope: !168, file: !62, line: 326, type: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !193, line: 173, size: 112, elements: !194)
!193 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "163f54fb1af2e21fea410f14eb18fa76")
!194 = !{!195, !199, !200}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !192, file: !193, line: 174, baseType: !196, size: 48)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 48, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 6)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !192, file: !193, line: 175, baseType: !196, size: 48, offset: 48)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !192, file: !193, line: 176, baseType: !201, size: 16, offset: 96)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !202, line: 28, baseType: !203)
!202 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "64bcf4b731906682de6e750679b9f4a2")
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !158, line: 24, baseType: !56)
!204 = !DILocalVariable(name: "ipv4_header", scope: !168, file: !62, line: 327, type: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !207, line: 87, size: 160, elements: !208)
!207 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "149778ace30a1ff208adc8783fd04b29")
!208 = !{!209, !211, !212, !213, !214, !215, !216, !217, !218, !220}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !206, file: !207, line: 89, baseType: !210, size: 4, flags: DIFlagBitField, extraData: i64 0)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !158, line: 21, baseType: !84)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !206, file: !207, line: 90, baseType: !210, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !206, file: !207, line: 97, baseType: !210, size: 8, offset: 8)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !206, file: !207, line: 98, baseType: !201, size: 16, offset: 16)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !206, file: !207, line: 99, baseType: !201, size: 16, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !206, file: !207, line: 100, baseType: !201, size: 16, offset: 48)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !206, file: !207, line: 101, baseType: !210, size: 8, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !206, file: !207, line: 102, baseType: !210, size: 8, offset: 72)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !206, file: !207, line: 103, baseType: !219, size: 16, offset: 80)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !202, line: 34, baseType: !203)
!220 = !DIDerivedType(tag: DW_TAG_member, scope: !206, file: !207, line: 104, baseType: !221, size: 64, offset: 96)
!221 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !206, file: !207, line: 104, size: 64, elements: !222)
!222 = !{!223, !230}
!223 = !DIDerivedType(tag: DW_TAG_member, scope: !221, file: !207, line: 104, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !221, file: !207, line: 104, size: 64, elements: !225)
!225 = !{!226, !229}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !224, file: !207, line: 104, baseType: !227, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !202, line: 30, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !158, line: 27, baseType: !7)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !224, file: !207, line: 104, baseType: !227, size: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !221, file: !207, line: 104, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !221, file: !207, line: 104, size: 64, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !231, file: !207, line: 104, baseType: !227, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !231, file: !207, line: 104, baseType: !227, size: 32, offset: 32)
!235 = !DILocalVariable(name: "ipv6_header", scope: !168, file: !62, line: 328, type: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !238, line: 118, size: 320, elements: !239)
!238 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "", checksumkind: CSK_MD5, checksum: "deff6bca6b519042089ed906aa3655c3")
!239 = !{!240, !241, !242, !246, !247, !248, !249}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !237, file: !238, line: 120, baseType: !210, size: 4, flags: DIFlagBitField, extraData: i64 0)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !237, file: !238, line: 121, baseType: !210, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !237, file: !238, line: 128, baseType: !243, size: 24, offset: 8)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 24, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 3)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !237, file: !238, line: 130, baseType: !201, size: 16, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !237, file: !238, line: 131, baseType: !210, size: 8, offset: 48)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !237, file: !238, line: 132, baseType: !210, size: 8, offset: 56)
!249 = !DIDerivedType(tag: DW_TAG_member, scope: !237, file: !238, line: 134, baseType: !250, size: 256, offset: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !237, file: !238, line: 134, size: 256, elements: !251)
!251 = !{!252, !273}
!252 = !DIDerivedType(tag: DW_TAG_member, scope: !250, file: !238, line: 134, baseType: !253, size: 256)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !250, file: !238, line: 134, size: 256, elements: !254)
!254 = !{!255, !272}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !253, file: !238, line: 134, baseType: !256, size: 128)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !257, line: 33, size: 128, elements: !258)
!257 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "", checksumkind: CSK_MD5, checksum: "8bebb780b45d3fe932cc1d934fa5f5fe")
!258 = !{!259}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !256, file: !257, line: 40, baseType: !260, size: 128)
!260 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !256, file: !257, line: 34, size: 128, elements: !261)
!261 = !{!262, !266, !270}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !260, file: !257, line: 35, baseType: !263, size: 128)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 128, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 16)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !260, file: !257, line: 37, baseType: !267, size: 128)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 128, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 8)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !260, file: !257, line: 38, baseType: !271, size: 128)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 128, elements: !161)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !253, file: !238, line: 134, baseType: !256, size: 128, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !250, file: !238, line: 134, baseType: !274, size: 256)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !250, file: !238, line: 134, size: 256, elements: !275)
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !274, file: !238, line: 134, baseType: !256, size: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !274, file: !238, line: 134, baseType: !256, size: 128, offset: 128)
!278 = !DILocalVariable(name: "protocol", scope: !279, file: !62, line: 344, type: !68)
!279 = distinct !DILexicalBlock(scope: !280, file: !62, line: 342, column: 48)
!280 = distinct !DILexicalBlock(scope: !168, file: !62, line: 342, column: 6)
!281 = !DILocalVariable(name: "ipv4_source", scope: !279, file: !62, line: 346, type: !93)
!282 = !DILocalVariable(name: "ipv4_dest", scope: !279, file: !62, line: 347, type: !93)
!283 = !DILocalVariable(name: "udp_header", scope: !284, file: !62, line: 370, type: !286)
!284 = distinct !DILexicalBlock(scope: !285, file: !62, line: 368, column: 32)
!285 = distinct !DILexicalBlock(scope: !279, file: !62, line: 368, column: 7)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !288, line: 23, size: 64, elements: !289)
!288 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "", checksumkind: CSK_MD5, checksum: "53c0d42e1bf6d93b39151764be2d20fb")
!289 = !{!290, !291, !292, !293}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !287, file: !288, line: 24, baseType: !201, size: 16)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !287, file: !288, line: 25, baseType: !201, size: 16, offset: 16)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !287, file: !288, line: 26, baseType: !201, size: 16, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !287, file: !288, line: 27, baseType: !219, size: 16, offset: 48)
!294 = !DILocalVariable(name: "length", scope: !284, file: !62, line: 372, type: !68)
!295 = !DILocalVariable(name: "port_source", scope: !284, file: !62, line: 377, type: !55)
!296 = !DILocalVariable(name: "port_dest", scope: !284, file: !62, line: 384, type: !55)
!297 = !DILocalVariable(name: "tcp_header", scope: !298, file: !62, line: 419, type: !300)
!298 = distinct !DILexicalBlock(scope: !299, file: !62, line: 417, column: 39)
!299 = distinct !DILexicalBlock(scope: !285, file: !62, line: 417, column: 14)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !302, line: 25, size: 160, elements: !303)
!302 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "", checksumkind: CSK_MD5, checksum: "0fb7164446a017a2406c1e3b94b6d7a6")
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !301, file: !302, line: 26, baseType: !201, size: 16)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !301, file: !302, line: 27, baseType: !201, size: 16, offset: 16)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !301, file: !302, line: 28, baseType: !227, size: 32, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !301, file: !302, line: 29, baseType: !227, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !301, file: !302, line: 31, baseType: !203, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !301, file: !302, line: 32, baseType: !203, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !301, file: !302, line: 33, baseType: !203, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !301, file: !302, line: 34, baseType: !203, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !301, file: !302, line: 35, baseType: !203, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !301, file: !302, line: 36, baseType: !203, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !301, file: !302, line: 37, baseType: !203, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !301, file: !302, line: 38, baseType: !203, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !301, file: !302, line: 39, baseType: !203, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !301, file: !302, line: 40, baseType: !203, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !301, file: !302, line: 55, baseType: !201, size: 16, offset: 112)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !301, file: !302, line: 56, baseType: !219, size: 16, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !301, file: !302, line: 57, baseType: !201, size: 16, offset: 144)
!321 = !DILocalVariable(name: "length", scope: !298, file: !62, line: 421, type: !68)
!322 = !DILocalVariable(name: "port_source", scope: !298, file: !62, line: 433, type: !55)
!323 = !DILocalVariable(name: "port_dest", scope: !298, file: !62, line: 440, type: !55)
!324 = !DILocalVariable(name: "icmp_header", scope: !325, file: !62, line: 467, type: !327)
!325 = distinct !DILexicalBlock(scope: !326, file: !62, line: 465, column: 40)
!326 = distinct !DILexicalBlock(scope: !299, file: !62, line: 465, column: 14)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmphdr", file: !329, line: 89, size: 64, elements: !330)
!329 = !DIFile(filename: "/usr/include/linux/icmp.h", directory: "", checksumkind: CSK_MD5, checksum: "a505632898dce546638b3344627d334b")
!330 = !{!331, !332, !333, !334}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !328, file: !329, line: 90, baseType: !210, size: 8)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !328, file: !329, line: 91, baseType: !210, size: 8, offset: 8)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !328, file: !329, line: 92, baseType: !219, size: 16, offset: 16)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "un", scope: !328, file: !329, line: 104, baseType: !335, size: 32, offset: 32)
!335 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !328, file: !329, line: 93, size: 32, elements: !336)
!336 = !{!337, !342, !343, !348}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "echo", scope: !335, file: !329, line: 97, baseType: !338, size: 32)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !335, file: !329, line: 94, size: 32, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !338, file: !329, line: 95, baseType: !201, size: 16)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !338, file: !329, line: 96, baseType: !201, size: 16, offset: 16)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "gateway", scope: !335, file: !329, line: 98, baseType: !227, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "frag", scope: !335, file: !329, line: 102, baseType: !344, size: 32)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !335, file: !329, line: 99, size: 32, elements: !345)
!345 = !{!346, !347}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !344, file: !329, line: 100, baseType: !201, size: 16)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !344, file: !329, line: 101, baseType: !201, size: 16, offset: 16)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !335, file: !329, line: 103, baseType: !349, size: 32)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 32, elements: !161)
!350 = !DILocalVariable(name: "protocol", scope: !351, file: !62, line: 487, type: !68)
!351 = distinct !DILexicalBlock(scope: !352, file: !62, line: 485, column: 57)
!352 = distinct !DILexicalBlock(scope: !280, file: !62, line: 485, column: 13)
!353 = !DILocalVariable(name: "ipv6_source", scope: !351, file: !62, line: 489, type: !119)
!354 = !DILocalVariable(name: "ipv6_dest", scope: !351, file: !62, line: 490, type: !119)
!355 = !DILocalVariable(name: "udp_header", scope: !356, file: !62, line: 513, type: !286)
!356 = distinct !DILexicalBlock(scope: !357, file: !62, line: 511, column: 32)
!357 = distinct !DILexicalBlock(scope: !351, file: !62, line: 511, column: 7)
!358 = !DILocalVariable(name: "length", scope: !356, file: !62, line: 515, type: !68)
!359 = !DILocalVariable(name: "port_source", scope: !356, file: !62, line: 520, type: !55)
!360 = !DILocalVariable(name: "port_dest", scope: !356, file: !62, line: 527, type: !55)
!361 = !DILocalVariable(name: "tcp_header", scope: !362, file: !62, line: 553, type: !300)
!362 = distinct !DILexicalBlock(scope: !363, file: !62, line: 551, column: 39)
!363 = distinct !DILexicalBlock(scope: !357, file: !62, line: 551, column: 14)
!364 = !DILocalVariable(name: "length", scope: !362, file: !62, line: 555, type: !68)
!365 = !DILocalVariable(name: "port_source", scope: !362, file: !62, line: 567, type: !55)
!366 = !DILocalVariable(name: "port_dest", scope: !362, file: !62, line: 574, type: !55)
!367 = !DILocalVariable(name: "icmp_header", scope: !368, file: !62, line: 600, type: !327)
!368 = distinct !DILexicalBlock(scope: !369, file: !62, line: 598, column: 40)
!369 = distinct !DILexicalBlock(scope: !363, file: !62, line: 598, column: 14)
!370 = !DILocalVariable(name: "icmp6_header", scope: !371, file: !62, line: 616, type: !373)
!371 = distinct !DILexicalBlock(scope: !372, file: !62, line: 614, column: 42)
!372 = distinct !DILexicalBlock(scope: !369, file: !62, line: 614, column: 14)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmp6hdr", file: !375, line: 8, size: 64, elements: !376)
!375 = !DIFile(filename: "/usr/include/linux/icmpv6.h", directory: "", checksumkind: CSK_MD5, checksum: "0310ca5584e6f44f6eea6cf040ee84b9")
!376 = !{!377, !378, !379, !380}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_type", scope: !374, file: !375, line: 10, baseType: !210, size: 8)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_code", scope: !374, file: !375, line: 11, baseType: !210, size: 8, offset: 8)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_cksum", scope: !374, file: !375, line: 12, baseType: !219, size: 16, offset: 16)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_dataun", scope: !374, file: !375, line: 63, baseType: !381, size: 32, offset: 32)
!381 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !374, file: !375, line: 15, size: 32, elements: !382)
!382 = !{!383, !385, !389, !390, !395, !403}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "un_data32", scope: !381, file: !375, line: 16, baseType: !384, size: 32)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 32, elements: !69)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "un_data16", scope: !381, file: !375, line: 17, baseType: !386, size: 32)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 32, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 2)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "un_data8", scope: !381, file: !375, line: 18, baseType: !349, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "u_echo", scope: !381, file: !375, line: 23, baseType: !391, size: 32)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_echo", file: !375, line: 20, size: 32, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !391, file: !375, line: 21, baseType: !201, size: 16)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !391, file: !375, line: 22, baseType: !201, size: 16, offset: 16)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_advt", scope: !381, file: !375, line: 40, baseType: !396, size: 32)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_advt", file: !375, line: 25, size: 32, elements: !397)
!397 = !{!398, !399, !400, !401, !402}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !396, file: !375, line: 27, baseType: !228, size: 5, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "override", scope: !396, file: !375, line: 28, baseType: !228, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "solicited", scope: !396, file: !375, line: 29, baseType: !228, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "router", scope: !396, file: !375, line: 30, baseType: !228, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !396, file: !375, line: 31, baseType: !228, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_ra", scope: !381, file: !375, line: 61, baseType: !404, size: 32)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_ra", file: !375, line: 42, size: 32, elements: !405)
!405 = !{!406, !407, !408, !409, !410, !411, !412}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !404, file: !375, line: 43, baseType: !210, size: 8)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !404, file: !375, line: 45, baseType: !210, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "router_pref", scope: !404, file: !375, line: 46, baseType: !210, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 8)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "home_agent", scope: !404, file: !375, line: 47, baseType: !210, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 8)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !404, file: !375, line: 48, baseType: !210, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 8)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "managed", scope: !404, file: !375, line: 49, baseType: !210, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 8)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "rt_lifetime", scope: !404, file: !375, line: 60, baseType: !201, size: 16, offset: 16)
!413 = !DILocation(line: 0, scope: !168)
!414 = !DILocation(line: 317, column: 38, scope: !168)
!415 = !{!416, !417, i64 4}
!416 = !{!"xdp_md", !417, i64 0, !417, i64 4, !417, i64 8, !417, i64 12, !417, i64 16, !417, i64 20}
!417 = !{!"int", !418, i64 0}
!418 = !{!"omnipotent char", !419, i64 0}
!419 = !{!"Simple C/C++ TBAA"}
!420 = !DILocation(line: 317, column: 27, scope: !168)
!421 = !DILocation(line: 317, column: 19, scope: !168)
!422 = !DILocation(line: 318, column: 34, scope: !168)
!423 = !{!416, !417, i64 0}
!424 = !DILocation(line: 318, column: 23, scope: !168)
!425 = !DILocation(line: 318, column: 15, scope: !168)
!426 = !DILocation(line: 320, column: 11, scope: !427)
!427 = distinct !DILexicalBlock(scope: !168, file: !62, line: 320, column: 6)
!428 = !DILocation(line: 320, column: 35, scope: !427)
!429 = !DILocation(line: 320, column: 6, scope: !168)
!430 = !DILocalVariable(name: "nh", arg: 1, scope: !431, file: !187, line: 151, type: !434)
!431 = distinct !DISubprogram(name: "parse_ethhdr", scope: !187, file: !187, line: 151, type: !432, scopeLine: 151, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !436)
!432 = !DISubroutineType(types: !433)
!433 = !{!68, !434, !53, !435}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!436 = !{!430, !437, !438, !439, !440, !447, !448}
!437 = !DILocalVariable(name: "data_end", arg: 2, scope: !431, file: !187, line: 151, type: !53)
!438 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !431, file: !187, line: 151, type: !435)
!439 = !DILocalVariable(name: "eth", scope: !431, file: !187, line: 153, type: !191)
!440 = !DILocalVariable(name: "vlh", scope: !431, file: !187, line: 154, type: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlanhdr", file: !187, line: 38, size: 32, elements: !443)
!443 = !{!444, !446}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !442, file: !187, line: 39, baseType: !445, size: 16)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !6, line: 20, baseType: !55)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !442, file: !187, line: 40, baseType: !445, size: 16, offset: 16)
!447 = !DILocalVariable(name: "h_proto", scope: !431, file: !187, line: 155, type: !55)
!448 = !DILocalVariable(name: "i", scope: !431, file: !187, line: 156, type: !68)
!449 = !DILocation(line: 0, scope: !431, inlinedAt: !450)
!450 = distinct !DILocation(line: 331, column: 22, scope: !168)
!451 = !DILocation(line: 164, column: 17, scope: !431, inlinedAt: !450)
!452 = !{!453, !453, i64 0}
!453 = !{!"short", !418, i64 0}
!454 = !DILocalVariable(name: "h_proto", arg: 1, scope: !455, file: !187, line: 109, type: !55)
!455 = distinct !DISubprogram(name: "proto_is_vlan", scope: !187, file: !187, line: 109, type: !456, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !458)
!456 = !DISubroutineType(types: !457)
!457 = !{!68, !55}
!458 = !{!454}
!459 = !DILocation(line: 0, scope: !455, inlinedAt: !460)
!460 = distinct !DILocation(line: 172, column: 8, scope: !461, inlinedAt: !450)
!461 = distinct !DILexicalBlock(scope: !462, file: !187, line: 172, column: 7)
!462 = distinct !DILexicalBlock(scope: !463, file: !187, line: 170, column: 39)
!463 = distinct !DILexicalBlock(scope: !464, file: !187, line: 170, column: 2)
!464 = distinct !DILexicalBlock(scope: !431, file: !187, line: 170, column: 2)
!465 = !DILocation(line: 110, column: 20, scope: !455, inlinedAt: !460)
!466 = !DILocation(line: 110, column: 46, scope: !455, inlinedAt: !460)
!467 = !DILocation(line: 172, column: 8, scope: !461, inlinedAt: !450)
!468 = !DILocation(line: 172, column: 7, scope: !462, inlinedAt: !450)
!469 = !DILocation(line: 180, column: 18, scope: !462, inlinedAt: !450)
!470 = !DILocation(line: 342, column: 6, scope: !168)
!471 = !DILocalVariable(name: "nh", arg: 1, scope: !472, file: !187, line: 191, type: !434)
!472 = distinct !DISubprogram(name: "parse_iphdr", scope: !187, file: !187, line: 191, type: !473, scopeLine: 191, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !476)
!473 = !DISubroutineType(types: !474)
!474 = !{!68, !434, !53, !475}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!476 = !{!471, !477, !478, !479, !480}
!477 = !DILocalVariable(name: "data_end", arg: 2, scope: !472, file: !187, line: 191, type: !53)
!478 = !DILocalVariable(name: "iphdr", arg: 3, scope: !472, file: !187, line: 191, type: !475)
!479 = !DILocalVariable(name: "iph", scope: !472, file: !187, line: 193, type: !205)
!480 = !DILocalVariable(name: "hdrsize", scope: !472, file: !187, line: 194, type: !68)
!481 = !DILocation(line: 0, scope: !472, inlinedAt: !482)
!482 = distinct !DILocation(line: 344, column: 18, scope: !279)
!483 = !DILocation(line: 196, column: 10, scope: !484, inlinedAt: !482)
!484 = distinct !DILexicalBlock(scope: !472, file: !187, line: 196, column: 6)
!485 = !DILocation(line: 196, column: 14, scope: !484, inlinedAt: !482)
!486 = !DILocation(line: 196, column: 6, scope: !472, inlinedAt: !482)
!487 = !DILocation(line: 200, column: 17, scope: !472, inlinedAt: !482)
!488 = !DILocation(line: 200, column: 21, scope: !472, inlinedAt: !482)
!489 = !DILocation(line: 203, column: 14, scope: !490, inlinedAt: !482)
!490 = distinct !DILexicalBlock(scope: !472, file: !187, line: 203, column: 6)
!491 = !DILocation(line: 203, column: 24, scope: !490, inlinedAt: !482)
!492 = !DILocation(line: 203, column: 6, scope: !472, inlinedAt: !482)
!493 = !DILocation(line: 0, scope: !279)
!494 = !DILocation(line: 346, column: 3, scope: !279)
!495 = !DILocation(line: 368, column: 7, scope: !279)
!496 = !DILocation(line: 210, column: 14, scope: !472, inlinedAt: !482)
!497 = !{!498, !418, i64 9}
!498 = !{!"iphdr", !418, i64 0, !418, i64 0, !418, i64 1, !453, i64 2, !453, i64 4, !453, i64 6, !418, i64 8, !418, i64 9, !453, i64 10, !418, i64 12}
!499 = !DILocation(line: 350, column: 4, scope: !500)
!500 = distinct !DILexicalBlock(scope: !501, file: !62, line: 349, column: 20)
!501 = distinct !DILexicalBlock(scope: !279, file: !62, line: 349, column: 7)
!502 = !DILocation(line: 354, column: 19, scope: !503)
!503 = distinct !DILexicalBlock(scope: !279, file: !62, line: 354, column: 7)
!504 = !DILocation(line: 354, column: 7, scope: !279)
!505 = !DILocalVariable(name: "address", arg: 1, scope: !506, file: !62, line: 132, type: !92)
!506 = distinct !DISubprogram(name: "is_filtered_ipv4", scope: !62, file: !62, line: 132, type: !507, scopeLine: 132, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !510)
!507 = !DISubroutineType(types: !508)
!508 = !{!509, !92}
!509 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!510 = !{!505, !511}
!511 = !DILocalVariable(name: "banned", scope: !506, file: !62, line: 134, type: !82)
!512 = !DILocation(line: 0, scope: !506, inlinedAt: !513)
!513 = distinct !DILocation(line: 356, column: 8, scope: !514)
!514 = distinct !DILexicalBlock(scope: !515, file: !62, line: 356, column: 8)
!515 = distinct !DILexicalBlock(scope: !503, file: !62, line: 354, column: 25)
!516 = !DILocation(line: 136, column: 11, scope: !506, inlinedAt: !513)
!517 = !DILocation(line: 138, column: 13, scope: !518, inlinedAt: !513)
!518 = distinct !DILexicalBlock(scope: !506, file: !62, line: 138, column: 6)
!519 = !DILocation(line: 356, column: 8, scope: !515)
!520 = !DILocation(line: 0, scope: !284)
!521 = !DILocalVariable(name: "nh", arg: 1, scope: !522, file: !187, line: 259, type: !434)
!522 = distinct !DISubprogram(name: "parse_udphdr", scope: !187, file: !187, line: 259, type: !523, scopeLine: 259, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !526)
!523 = !DISubroutineType(types: !524)
!524 = !{!68, !434, !53, !525}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!526 = !{!521, !527, !528, !529, !530}
!527 = !DILocalVariable(name: "data_end", arg: 2, scope: !522, file: !187, line: 259, type: !53)
!528 = !DILocalVariable(name: "udphdr", arg: 3, scope: !522, file: !187, line: 259, type: !525)
!529 = !DILocalVariable(name: "len", scope: !522, file: !187, line: 261, type: !68)
!530 = !DILocalVariable(name: "udph", scope: !522, file: !187, line: 262, type: !286)
!531 = !DILocation(line: 0, scope: !522, inlinedAt: !532)
!532 = distinct !DILocation(line: 372, column: 17, scope: !284)
!533 = !DILocation(line: 264, column: 11, scope: !534, inlinedAt: !532)
!534 = distinct !DILexicalBlock(scope: !522, file: !187, line: 264, column: 6)
!535 = !DILocation(line: 264, column: 15, scope: !534, inlinedAt: !532)
!536 = !DILocation(line: 264, column: 6, scope: !522, inlinedAt: !532)
!537 = !DILocation(line: 271, column: 8, scope: !522, inlinedAt: !532)
!538 = !{!539, !453, i64 4}
!539 = !{!"udphdr", !453, i64 0, !453, i64 2, !453, i64 4, !453, i64 6}
!540 = !DILocation(line: 272, column: 10, scope: !541, inlinedAt: !532)
!541 = distinct !DILexicalBlock(scope: !522, file: !187, line: 272, column: 6)
!542 = !DILocation(line: 272, column: 6, scope: !522, inlinedAt: !532)
!543 = !DILocation(line: 377, column: 36, scope: !284)
!544 = !{!539, !453, i64 0}
!545 = !DILocation(line: 0, scope: !546, inlinedAt: !552)
!546 = distinct !DISubprogram(name: "is_filtered_port", scope: !62, file: !62, line: 160, type: !547, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !549)
!547 = !DISubroutineType(types: !548)
!548 = !{!509, !55}
!549 = !{!550, !551}
!550 = !DILocalVariable(name: "port", arg: 1, scope: !546, file: !62, line: 160, type: !55)
!551 = !DILocalVariable(name: "blocked_port", scope: !546, file: !62, line: 162, type: !82)
!552 = distinct !DILocation(line: 380, column: 8, scope: !553)
!553 = distinct !DILexicalBlock(scope: !284, file: !62, line: 380, column: 8)
!554 = !DILocation(line: 164, column: 17, scope: !546, inlinedAt: !552)
!555 = !DILocation(line: 166, column: 19, scope: !556, inlinedAt: !552)
!556 = distinct !DILexicalBlock(scope: !546, file: !62, line: 166, column: 6)
!557 = !DILocation(line: 172, column: 1, scope: !546, inlinedAt: !552)
!558 = !DILocation(line: 380, column: 8, scope: !284)
!559 = !DILocation(line: 384, column: 34, scope: !284)
!560 = !{!539, !453, i64 2}
!561 = !DILocation(line: 0, scope: !546, inlinedAt: !562)
!562 = distinct !DILocation(line: 387, column: 8, scope: !563)
!563 = distinct !DILexicalBlock(scope: !284, file: !62, line: 387, column: 8)
!564 = !DILocation(line: 164, column: 17, scope: !546, inlinedAt: !562)
!565 = !DILocation(line: 166, column: 19, scope: !556, inlinedAt: !562)
!566 = !DILocation(line: 172, column: 1, scope: !546, inlinedAt: !562)
!567 = !DILocation(line: 0, scope: !298)
!568 = !DILocalVariable(name: "nh", arg: 1, scope: !569, file: !187, line: 298, type: !434)
!569 = distinct !DISubprogram(name: "parse_tcphdr", scope: !187, file: !187, line: 298, type: !570, scopeLine: 298, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !573)
!570 = !DISubroutineType(types: !571)
!571 = !{!68, !434, !53, !572}
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!573 = !{!568, !574, !575, !576, !577}
!574 = !DILocalVariable(name: "data_end", arg: 2, scope: !569, file: !187, line: 298, type: !53)
!575 = !DILocalVariable(name: "tcphdr", arg: 3, scope: !569, file: !187, line: 298, type: !572)
!576 = !DILocalVariable(name: "len", scope: !569, file: !187, line: 300, type: !68)
!577 = !DILocalVariable(name: "tcph", scope: !569, file: !187, line: 301, type: !300)
!578 = !DILocation(line: 0, scope: !569, inlinedAt: !579)
!579 = distinct !DILocation(line: 421, column: 17, scope: !298)
!580 = !DILocation(line: 303, column: 11, scope: !581, inlinedAt: !579)
!581 = distinct !DILexicalBlock(scope: !569, file: !187, line: 303, column: 6)
!582 = !DILocation(line: 303, column: 15, scope: !581, inlinedAt: !579)
!583 = !DILocation(line: 303, column: 6, scope: !569, inlinedAt: !579)
!584 = !DILocation(line: 307, column: 14, scope: !569, inlinedAt: !579)
!585 = !DILocation(line: 307, column: 19, scope: !569, inlinedAt: !579)
!586 = !DILocation(line: 308, column: 20, scope: !587, inlinedAt: !579)
!587 = distinct !DILexicalBlock(scope: !569, file: !187, line: 308, column: 6)
!588 = !DILocation(line: 308, column: 26, scope: !587, inlinedAt: !579)
!589 = !DILocation(line: 308, column: 6, scope: !569, inlinedAt: !579)
!590 = !DILocalVariable(name: "tcp_header", arg: 1, scope: !591, file: !62, line: 252, type: !300)
!591 = distinct !DISubprogram(name: "is_filtered_nmap_tcp_scan", scope: !62, file: !62, line: 252, type: !592, scopeLine: 252, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !594)
!592 = !DISubroutineType(types: !593)
!593 = !{!509, !300}
!594 = !{!590}
!595 = !DILocation(line: 0, scope: !591, inlinedAt: !596)
!596 = distinct !DILocation(line: 427, column: 8, scope: !597)
!597 = distinct !DILexicalBlock(scope: !298, file: !62, line: 427, column: 8)
!598 = !DILocation(line: 256, column: 3, scope: !599, inlinedAt: !596)
!599 = distinct !DILexicalBlock(scope: !591, file: !62, line: 255, column: 3)
!600 = !DILocation(line: 277, column: 18, scope: !601, inlinedAt: !596)
!601 = distinct !DILexicalBlock(scope: !591, file: !62, line: 269, column: 3)
!602 = !{!603, !453, i64 14}
!603 = !{!"tcphdr", !453, i64 0, !453, i64 2, !417, i64 4, !417, i64 8, !453, i64 12, !453, i64 12, !453, i64 13, !453, i64 13, !453, i64 13, !453, i64 13, !453, i64 13, !453, i64 13, !453, i64 13, !453, i64 13, !453, i64 14, !453, i64 16, !453, i64 18}
!604 = !DILocation(line: 277, column: 25, scope: !601, inlinedAt: !596)
!605 = !DILocation(line: 269, column: 3, scope: !591, inlinedAt: !596)
!606 = !DILocalVariable(name: "tcp_header", arg: 1, scope: !607, file: !62, line: 286, type: !300)
!607 = distinct !DISubprogram(name: "is_likely_nmap_tcp_scan", scope: !62, file: !62, line: 286, type: !592, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !608)
!608 = !{!606}
!609 = !DILocation(line: 0, scope: !607, inlinedAt: !610)
!610 = distinct !DILocation(line: 429, column: 15, scope: !611)
!611 = distinct !DILexicalBlock(scope: !597, file: !62, line: 429, column: 15)
!612 = !DILocation(line: 292, column: 3, scope: !613, inlinedAt: !610)
!613 = distinct !DILexicalBlock(scope: !607, file: !62, line: 291, column: 3)
!614 = !DILocation(line: 298, column: 18, scope: !613, inlinedAt: !610)
!615 = !DILocation(line: 298, column: 25, scope: !613, inlinedAt: !610)
!616 = !DILocation(line: 291, column: 3, scope: !607, inlinedAt: !610)
!617 = !DILocalVariable(name: "address", arg: 1, scope: !618, file: !62, line: 60, type: !92)
!618 = distinct !DISubprogram(name: "warn_ipv4", scope: !62, file: !62, line: 60, type: !619, scopeLine: 60, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !620)
!619 = !DISubroutineType(cc: DW_CC_nocall, types: !508)
!620 = !{!617, !621, !622, !625, !628}
!621 = !DILocalVariable(name: "warnings_ipv4", scope: !618, file: !62, line: 62, type: !82)
!622 = !DILocalVariable(name: "tmp", scope: !623, file: !62, line: 68, type: !83)
!623 = distinct !DILexicalBlock(scope: !624, file: !62, line: 66, column: 29)
!624 = distinct !DILexicalBlock(scope: !618, file: !62, line: 66, column: 6)
!625 = !DILocalVariable(name: "banned", scope: !626, file: !62, line: 76, type: !83)
!626 = distinct !DILexicalBlock(scope: !627, file: !62, line: 74, column: 17)
!627 = distinct !DILexicalBlock(scope: !623, file: !62, line: 74, column: 7)
!628 = !DILocalVariable(name: "tmp", scope: !629, file: !62, line: 86, type: !83)
!629 = distinct !DILexicalBlock(scope: !624, file: !62, line: 84, column: 9)
!630 = !DILocation(line: 0, scope: !618, inlinedAt: !631)
!631 = distinct !DILocation(line: 430, column: 5, scope: !632)
!632 = distinct !DILexicalBlock(scope: !611, file: !62, line: 429, column: 60)
!633 = !DILocation(line: 64, column: 18, scope: !618, inlinedAt: !631)
!634 = !DILocation(line: 66, column: 20, scope: !624, inlinedAt: !631)
!635 = !DILocation(line: 66, column: 6, scope: !618, inlinedAt: !631)
!636 = !DILocation(line: 68, column: 3, scope: !623, inlinedAt: !631)
!637 = !DILocation(line: 0, scope: !623, inlinedAt: !631)
!638 = !DILocation(line: 70, column: 9, scope: !623, inlinedAt: !631)
!639 = !{!418, !418, i64 0}
!640 = !DILocation(line: 70, column: 24, scope: !623, inlinedAt: !631)
!641 = !DILocation(line: 70, column: 7, scope: !623, inlinedAt: !631)
!642 = !DILocation(line: 72, column: 3, scope: !623, inlinedAt: !631)
!643 = !DILocation(line: 74, column: 7, scope: !627, inlinedAt: !631)
!644 = !DILocation(line: 74, column: 11, scope: !627, inlinedAt: !631)
!645 = !DILocation(line: 74, column: 7, scope: !623, inlinedAt: !631)
!646 = !DILocation(line: 76, column: 4, scope: !626, inlinedAt: !631)
!647 = !DILocation(line: 0, scope: !626, inlinedAt: !631)
!648 = !DILocation(line: 76, column: 9, scope: !626, inlinedAt: !631)
!649 = !DILocation(line: 77, column: 4, scope: !626, inlinedAt: !631)
!650 = !DILocation(line: 79, column: 8, scope: !626, inlinedAt: !631)
!651 = !DILocation(line: 80, column: 4, scope: !626, inlinedAt: !631)
!652 = !DILocation(line: 82, column: 3, scope: !627, inlinedAt: !631)
!653 = !DILocation(line: 82, column: 3, scope: !626, inlinedAt: !631)
!654 = !DILocation(line: 84, column: 2, scope: !624, inlinedAt: !631)
!655 = !DILocation(line: 84, column: 2, scope: !623, inlinedAt: !631)
!656 = !DILocation(line: 86, column: 3, scope: !629, inlinedAt: !631)
!657 = !DILocation(line: 0, scope: !629, inlinedAt: !631)
!658 = !DILocation(line: 86, column: 8, scope: !629, inlinedAt: !631)
!659 = !DILocation(line: 88, column: 3, scope: !629, inlinedAt: !631)
!660 = !DILocation(line: 90, column: 2, scope: !624, inlinedAt: !631)
!661 = !DILocation(line: 433, column: 36, scope: !298)
!662 = !{!603, !453, i64 0}
!663 = !DILocation(line: 0, scope: !546, inlinedAt: !664)
!664 = distinct !DILocation(line: 436, column: 8, scope: !665)
!665 = distinct !DILexicalBlock(scope: !298, file: !62, line: 436, column: 8)
!666 = !DILocation(line: 164, column: 17, scope: !546, inlinedAt: !664)
!667 = !DILocation(line: 166, column: 19, scope: !556, inlinedAt: !664)
!668 = !DILocation(line: 172, column: 1, scope: !546, inlinedAt: !664)
!669 = !DILocation(line: 436, column: 8, scope: !298)
!670 = !DILocation(line: 440, column: 34, scope: !298)
!671 = !{!603, !453, i64 2}
!672 = !DILocation(line: 0, scope: !546, inlinedAt: !673)
!673 = distinct !DILocation(line: 443, column: 8, scope: !674)
!674 = distinct !DILexicalBlock(scope: !298, file: !62, line: 443, column: 8)
!675 = !DILocation(line: 164, column: 17, scope: !546, inlinedAt: !673)
!676 = !DILocation(line: 166, column: 19, scope: !556, inlinedAt: !673)
!677 = !DILocation(line: 172, column: 1, scope: !546, inlinedAt: !673)
!678 = !DILocation(line: 0, scope: !325)
!679 = !DILocalVariable(name: "nh", arg: 1, scope: !680, file: !187, line: 214, type: !434)
!680 = distinct !DISubprogram(name: "parse_icmphdr", scope: !187, file: !187, line: 214, type: !681, scopeLine: 214, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !684)
!681 = !DISubroutineType(cc: DW_CC_nocall, types: !682)
!682 = !{!68, !434, !53, !683}
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!684 = !{!679, !685, !686, !687}
!685 = !DILocalVariable(name: "data_end", arg: 2, scope: !680, file: !187, line: 214, type: !53)
!686 = !DILocalVariable(name: "icmphdr", arg: 3, scope: !680, file: !187, line: 214, type: !683)
!687 = !DILocalVariable(name: "icmph", scope: !680, file: !187, line: 216, type: !327)
!688 = !DILocation(line: 0, scope: !680, inlinedAt: !689)
!689 = distinct !DILocation(line: 469, column: 4, scope: !325)
!690 = !DILocation(line: 218, column: 12, scope: !691, inlinedAt: !689)
!691 = distinct !DILexicalBlock(scope: !680, file: !187, line: 218, column: 6)
!692 = !DILocation(line: 218, column: 16, scope: !691, inlinedAt: !689)
!693 = !DILocation(line: 218, column: 6, scope: !680, inlinedAt: !689)
!694 = !DILocalVariable(name: "icmp_header", arg: 1, scope: !695, file: !62, line: 174, type: !327)
!695 = distinct !DISubprogram(name: "is_filtered_icmp_packet", scope: !62, file: !62, line: 174, type: !696, scopeLine: 174, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !698)
!696 = !DISubroutineType(types: !697)
!697 = !{!509, !327}
!698 = !{!694, !699}
!699 = !DILocalVariable(name: "type", scope: !695, file: !62, line: 176, type: !68)
!700 = !DILocation(line: 0, scope: !695, inlinedAt: !701)
!701 = distinct !DILocation(line: 471, column: 23, scope: !702)
!702 = distinct !DILexicalBlock(scope: !325, file: !62, line: 471, column: 8)
!703 = !DILocation(line: 176, column: 26, scope: !695, inlinedAt: !701)
!704 = !{!705, !418, i64 0}
!705 = !{!"icmphdr", !418, i64 0, !418, i64 1, !453, i64 2, !418, i64 4}
!706 = !DILocation(line: 179, column: 8, scope: !707, inlinedAt: !701)
!707 = distinct !DILexicalBlock(scope: !695, file: !62, line: 179, column: 3)
!708 = !DILocation(line: 180, column: 3, scope: !707, inlinedAt: !701)
!709 = !DILocation(line: 195, column: 18, scope: !707, inlinedAt: !701)
!710 = !DILocation(line: 483, column: 3, scope: !279)
!711 = !DILocation(line: 485, column: 2, scope: !280)
!712 = !DILocalVariable(name: "nh", arg: 1, scope: !713, file: !187, line: 229, type: !434)
!713 = distinct !DISubprogram(name: "parse_ipv6hdr", scope: !187, file: !187, line: 229, type: !714, scopeLine: 229, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !717)
!714 = !DISubroutineType(types: !715)
!715 = !{!68, !434, !53, !716}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!717 = !{!712, !718, !719, !720}
!718 = !DILocalVariable(name: "data_end", arg: 2, scope: !713, file: !187, line: 229, type: !53)
!719 = !DILocalVariable(name: "ip6hdr", arg: 3, scope: !713, file: !187, line: 229, type: !716)
!720 = !DILocalVariable(name: "ip6h", scope: !713, file: !187, line: 231, type: !236)
!721 = !DILocation(line: 0, scope: !713, inlinedAt: !722)
!722 = distinct !DILocation(line: 487, column: 18, scope: !351)
!723 = !DILocation(line: 233, column: 11, scope: !724, inlinedAt: !722)
!724 = distinct !DILexicalBlock(scope: !713, file: !187, line: 233, column: 6)
!725 = !DILocation(line: 233, column: 15, scope: !724, inlinedAt: !722)
!726 = !DILocation(line: 233, column: 6, scope: !713, inlinedAt: !722)
!727 = !DILocalVariable(name: "nh", arg: 1, scope: !728, file: !187, line: 113, type: !434)
!728 = distinct !DISubprogram(name: "skip_ip6hdrext", scope: !187, file: !187, line: 113, type: !729, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !731)
!729 = !DISubroutineType(types: !730)
!730 = !{!68, !434, !53, !83}
!731 = !{!727, !732, !733, !734, !736}
!732 = !DILocalVariable(name: "data_end", arg: 2, scope: !728, file: !187, line: 113, type: !53)
!733 = !DILocalVariable(name: "next_hdr_type", arg: 3, scope: !728, file: !187, line: 113, type: !83)
!734 = !DILocalVariable(name: "i", scope: !735, file: !187, line: 115, type: !68)
!735 = distinct !DILexicalBlock(scope: !728, file: !187, line: 115, column: 2)
!736 = !DILocalVariable(name: "hdr", scope: !737, file: !187, line: 117, type: !739)
!737 = distinct !DILexicalBlock(scope: !738, file: !187, line: 115, column: 46)
!738 = distinct !DILexicalBlock(scope: !735, file: !187, line: 115, column: 2)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6_opt_hdr", file: !238, line: 63, size: 16, elements: !741)
!741 = !{!742, !743}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !740, file: !238, line: 64, baseType: !210, size: 8)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "hdrlen", scope: !740, file: !238, line: 65, baseType: !210, size: 8, offset: 8)
!744 = !DILocation(line: 0, scope: !728, inlinedAt: !745)
!745 = distinct !DILocation(line: 240, column: 9, scope: !713, inlinedAt: !722)
!746 = !DILocation(line: 0, scope: !735, inlinedAt: !745)
!747 = !DILocation(line: 0, scope: !737, inlinedAt: !745)
!748 = !DILocation(line: 119, column: 11, scope: !749, inlinedAt: !745)
!749 = distinct !DILexicalBlock(scope: !737, file: !187, line: 119, column: 7)
!750 = !DILocation(line: 119, column: 15, scope: !749, inlinedAt: !745)
!751 = !DILocation(line: 119, column: 7, scope: !737, inlinedAt: !745)
!752 = !DILocation(line: 240, column: 44, scope: !713, inlinedAt: !722)
!753 = !{!754, !418, i64 6}
!754 = !{!"ipv6hdr", !418, i64 0, !418, i64 0, !418, i64 1, !453, i64 4, !418, i64 6, !418, i64 7, !418, i64 8}
!755 = !DILocation(line: 123, column: 3, scope: !737, inlinedAt: !745)
!756 = !DILocation(line: 135, column: 5, scope: !757, inlinedAt: !745)
!757 = distinct !DILexicalBlock(scope: !737, file: !187, line: 123, column: 26)
!758 = !DILocation(line: 123, column: 11, scope: !737, inlinedAt: !745)
!759 = !DILocation(line: 141, column: 5, scope: !757, inlinedAt: !745)
!760 = !DILocation(line: 0, scope: !757, inlinedAt: !745)
!761 = !{!762, !418, i64 1}
!762 = !{!"ipv6_opt_hdr", !418, i64 0, !418, i64 1}
!763 = !{!762, !418, i64 0}
!764 = !DILocation(line: 131, column: 5, scope: !757, inlinedAt: !745)
!765 = !DILocation(line: 137, column: 27, scope: !757, inlinedAt: !745)
!766 = !DILocation(line: 139, column: 5, scope: !757, inlinedAt: !745)
!767 = !DILocation(line: 133, column: 35, scope: !757, inlinedAt: !745)
!768 = !DILocation(line: 133, column: 30, scope: !757, inlinedAt: !745)
!769 = !DILocation(line: 133, column: 47, scope: !757, inlinedAt: !745)
!770 = !DILocation(line: 133, column: 27, scope: !757, inlinedAt: !745)
!771 = !DILocation(line: 129, column: 35, scope: !757, inlinedAt: !745)
!772 = !DILocation(line: 129, column: 30, scope: !757, inlinedAt: !745)
!773 = !DILocation(line: 129, column: 47, scope: !757, inlinedAt: !745)
!774 = !DILocation(line: 129, column: 27, scope: !757, inlinedAt: !745)
!775 = !DILocation(line: 0, scope: !351)
!776 = !DILocation(line: 489, column: 3, scope: !351)
!777 = !DILocation(line: 511, column: 7, scope: !351)
!778 = !DILocation(line: 493, column: 4, scope: !779)
!779 = distinct !DILexicalBlock(scope: !780, file: !62, line: 492, column: 20)
!780 = distinct !DILexicalBlock(scope: !351, file: !62, line: 492, column: 7)
!781 = !DILocation(line: 497, column: 7, scope: !782)
!782 = distinct !DILexicalBlock(scope: !351, file: !62, line: 497, column: 7)
!783 = !{!784, !784, i64 0}
!784 = !{!"__int128", !418, i64 0}
!785 = !DILocation(line: 497, column: 19, scope: !782)
!786 = !DILocation(line: 497, column: 7, scope: !351)
!787 = !DILocalVariable(name: "address", arg: 1, scope: !788, file: !62, line: 146, type: !118)
!788 = distinct !DISubprogram(name: "is_filtered_ipv6", scope: !62, file: !62, line: 146, type: !789, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !791)
!789 = !DISubroutineType(types: !790)
!790 = !{!509, !118}
!791 = !{!787, !792}
!792 = !DILocalVariable(name: "banned", scope: !788, file: !62, line: 148, type: !82)
!793 = !DILocation(line: 0, scope: !788, inlinedAt: !794)
!794 = distinct !DILocation(line: 499, column: 8, scope: !795)
!795 = distinct !DILexicalBlock(scope: !796, file: !62, line: 499, column: 8)
!796 = distinct !DILexicalBlock(scope: !782, file: !62, line: 497, column: 25)
!797 = !DILocation(line: 150, column: 11, scope: !788, inlinedAt: !794)
!798 = !DILocation(line: 152, column: 13, scope: !799, inlinedAt: !794)
!799 = distinct !DILexicalBlock(scope: !788, file: !62, line: 152, column: 6)
!800 = !DILocation(line: 499, column: 8, scope: !796)
!801 = !DILocation(line: 0, scope: !356)
